[
  {
    "Faculty": "Dr. Nina Roy Choudhury",
    "Achievement Type": "Personal",
    "Details": "Awarded for outstanding contribution to higher education in the category of Contribution to Academic Administration by Higher Education Forum on 26/09/2021."
  },
  {
    "Faculty": "Dr. Nina Roy Choudhury",
    "Achievement Type": "Personal",
    "Details": "Appointed by Vice Chancellor as member of Scrutiny Committee (Humanities) to scrutinize proposals received from societies / trusts / sansthas for final permission of opening New Colleges for AY 2021 -22."
  },
  {
    "Faculty": "Dr. Nina Roy Choudhury",
    "Achievement Type": "Personal",
    "Details": "Appointed as Vice Chancellors nominee for CAS, Assistant Professor stage 3 to Associate Professor, stage 4 (History) at Guru Nanak Khalsa College of Arts, Science and Commerce (Autonomous) on 18/06/2021."
  },
  {
    "Faculty": "Dr. Nina Roy Choudhury",
    "Achievement Type": "Personal",
    "Details": "Appointed to the syllabus sub-committee to prepare the draft syllabus of MA English Language Teaching –Elective Paper– Literature and Media in English Language Education on 18/06/2021."
  },
  {
    "Faculty": "Dr. Nina Roy Choudhury",
    "Achievement Type": "Personal",
    "Details": "Appointed as Vice Chancellors nominee, subject expert, (English) for CAS, stage 3 to stage 4 at Dr. Shantilal Dhanji Devsey Arts College of Commerce and Science College, Wada on 03/07/2021."
  },
  {
    "Faculty": "Dr. Nina Roy Choudhury",
    "Achievement Type": "Personal",
    "Details": "Appointed by Vice Chancellor as member of scrutiny committee to scrutinize the proposals for Fast Track additional divisions for AY 2021-22 received from various colleges on 09/08/2021."
  },
  {
    "Faculty": "Dr. Nina Roy Choudhury",
    "Achievement Type": "Personal",
    "Details": "Conducted audit as a member of Expert Committee for Gender Audit for AY 2020-21 on18/08/2021 at Thakur College of Science and Commerce."
  },
  {
    "Faculty": "Dr. Nina Roy Choudhury",
    "Achievement Type": "Personal",
    "Details": "Appointed as Vice Chancellors nominee, subject expert, English, for CAS, Associate Prof Stage 4 to Prof Equivalent cadres (stage 5) on 21/01/2022 at Siddharth College of Commerce and Economics."
  },
  {
    "Faculty": "Mrs. Sangeeta Kore",
    "Achievement Type": "Personal",
    "Details": "Attended a Screening cum Evaluation Committee meeting as a Vice Chancellors Nominee as subject Expert at H.R. College of Commerce and Economics on 11/06/2021."
  },
  {
    "Faculty": "Mrs. Sangeeta Kore",
    "Achievement Type": "Personal",
    "Details": "Attended a Screening cum Evaluation Committee meeting as a Vice Chancellors Nominee as Subject Expert at L.S. Raheja College of Arts and Commerce on 29/06/2021."
  },
  {
    "Faculty": "Mrs. Sangeeta Kore",
    "Achievement Type": "Personal",
    "Details": "Attended a Screening cum Evaluation Committee meeting as a Vice Chancellors Nominee as subject Expert at N.M. College of Commerce and Economics on 06/07/2021."
  },
  {
    "Faculty": "Mrs. Sangeeta Kore",
    "Achievement Type": "Personal",
    "Details": "Attended a Screening cum Evaluation Committee meeting as a Vice Chancellors Nominee as Subject Expert at Shri Narayan Guru College of Commerce on 03/02/2022."
  },
  {
    "Faculty": "Mrs. Sangeeta Kore",
    "Achievement Type": "Personal",
    "Details": "Attended a Screening cum Evaluation Committee meeting as a Vice Chancellors Nominee as Subject Expert at N.M. College of Commerce and Economics on 12/02/2022."
  },
  {
    "Faculty": "Mrs. Sangeeta Kore",
    "Achievement Type": "Personal",
    "Details": "Attended a Screening cum Evaluation Committee meeting as a Vice Chancellors Nominee as subject Expert at L.S. Raheja College of Arts and Commerce on 16/02/2022."
  },
  {
    "Faculty": "Dr. Shanti Suresh",
    "Achievement Type": "Personal",
    "Details": "Attended a One week FDP on New education Policy in higher education-Context and Perspectives for Autonomous Colleges (Arts, Science, Commerce) RUSA in Association with IQAC OF VPMS K.G.Joshi college of Arts and N.G.Bedekar college of Commerce &IQAC of Ramanand Arya D.A.V.College 01/7/2021 to 07/7/2021."
  },
  {
    "Faculty": "Dr. Shanti Suresh",
    "Achievement Type": "Co-Curricular",
    "Details": "Attended a webinar on Diversity in the Classroom on 10/07/2021 organised by SIES Institute of Comprehensive Education Sion (West), Mumbai."
  },
  {
    "Faculty": "Dr. Shanti Suresh",
    "Achievement Type": "Personal",
    "Details": "Attended an Annual Refresher Course in Financial Markets and Emerging Business Models - UGC HRDC –Kerala, August 2021."
  },
  {
    "Faculty": "Dr. Shanti Suresh",
    "Achievement Type": "Personal",
    "Details": "Invited as subject Expert for the Pre-Submission Seminar of PhD on 08/09/2021 at Symbiosis Center for Research and Innovation, Symbiosis International University."
  },
  {
    "Faculty": "Dr. Shanti Suresh",
    "Achievement Type": "Personal",
    "Details": "Attended an AICTE Training and Learning (ATAL) Academy Online Advanced FDP on Sustainable Business Eco-System from 10/01/2022 to 14/01/2022 at National Institute of Technology, Rourkela."
  },
  {
    "Faculty": "Dr. Shanti Suresh",
    "Achievement Type": "Personal",
    "Details": "Attended an AICTE Training And Learning (ATAL) Academy Online Elementary FDP on Innovation Management from 21/01/2022 to 25/01/2022 at Institute of Management Studies, Banaras Hindu University."
  },
  {
    "Faculty": "Dr. Shanti Suresh",
    "Achievement Type": "Personal",
    "Details": "Invited as subject Expert for the PhD viva voce at Symbiosis Center for Research and Innovation, Symbiosis International University on 09/02/2022."
  },
  {
    "Faculty": "Dr. Shanti Suresh",
    "Achievement Type": "Personal",
    "Details": "Attended an AICTE Training and Learning (ATAL) Academy Online Advanced FDP on Innovative Technical Educational Practices and Academic Leadership from 7/02/2022 to 11/02/2022 at Shri Shankaracharya Technical Campus, Bhilai."
  },
  {
    "Faculty": "Dr. Shanti Suresh",
    "Achievement Type": "Personal",
    "Details": "Attended an AICTE Training and Learning (ATAL) Academy Online Advanced FDP on EDP on fostering Start-up, Innovation and Entrepreneurship / Intrapreneurship from 14/02/2022 to 18/02/2022 at Andhra University."
  },
  {
    "Faculty": "Dr. Shanti Suresh",
    "Achievement Type": "Personal",
    "Details": "Selected for the Five-day ICSSR-sponsored Capacity Building Workshop for Faculties and Senior PhD Scholars of Social Sciences organised by Madras Institute of Development Studies on the theme The State, Society and Market Understanding the dynamics and Interface from 21/03/2022 to 25/03/2022."
  },
  {
    "Faculty": "Ms. Anuprita Sardesai",
    "Achievement Type": "Personal",
    "Details": "Invited as a Vice Chancellors Nominee as subject Expert for appointment of Librarian at Atharva Institute of Management on 29/10/2021."
  },
  {
    "Faculty": "Dr. Seethalekshmy N.",
    "Achievement Type": "Personal",
    "Details": "Invited as an external examiner for Ph.D. interview by R.J. College of Arts, Science and Commerce on 20/7/2021."
  },
  {
    "Faculty": "Dr. Seethalekshmy N.",
    "Achievement Type": "Personal",
    "Details": "Successfully completed yoga training course from Ministry of Ayush, Govt. Of India. Invited as a resource person for the online refresher course conducted by Mulund College of Commerce, Mumbai on 4/02/2022."
  },
  {
    "Faculty": "Dr. Seethalekshmy N.",
    "Achievement Type": "Personal",
    "Details": "Appointed as an LIC member for continuation of recognition for the degree course in the subject of Ph.D. Commerce at M.D. College of Art, Science and Commerce, Mumbai on 20/12/2021."
  },
  {
    "Faculty": "Dr. Seethalekshmy N.",
    "Achievement Type": "Personal",
    "Details": "Invited as the keynote speaker of webinar on womens leadership in microfinance on 18/9/2021 sponsored by NABARD and organised by K.P.B. Hinduja College of Commerce."
  },
  {
    "Faculty": "Dr. Seethalekshmy N.",
    "Achievement Type": "Personal",
    "Details": "Attended a webinar on Intellectual Property Rights in Higher Education organised by ICLEs Motilal Jhunjhunwala College of Arts, Science & Commerce, Vashi on 11/02/2022."
  },
  {
    "Faculty": "Dr. Seethalekshmy N.",
    "Achievement Type": "Co-Curricular",
    "Details": "Conducted a Four-day Online Workshop on Research Writing organised by SIES CTD in collaboration with Ph.D. Centre of SIES College of Commerce and Economics on 10/12/2021, 17/12/2021, 22/12/2021 and 23/12/2021."
  },
  {
    "Faculty": "Dr. Seethalekshmy N.",
    "Achievement Type": "Personal",
    "Details": "Certified as Yoga Therapist, by the Yoga Certification Board under Ministry of Ayush, Government of India, evaluated by Indian Yoga Association."
  },
  {
    "Faculty": "CA Prasanna Tambe",
    "Achievement Type": "Personal",
    "Details": "Attended a Webinar on Commonly Observed Ethical Issues in CA Practice with related Case Studies Organised by Shivaji Park CPE Study Circle of ICAI on 12/06/2021."
  },
  {
    "Faculty": "CA Prasanna Tambe",
    "Achievement Type": "Personal",
    "Details": "Attended a Webinar on Compliance after changes in Income Tax E-filing Portal & Interplay between 194Q and 206C(1H) Organised by Shivaji Park CPE Study Circle of ICAI on 19/06/2021."
  },
  {
    "Faculty": "CA Prasanna Tambe",
    "Achievement Type": "Personal",
    "Details": "Attended a Webinar on Related party Transactions under Companies Act 2013, vis-a-vis AS-18 / Ind AS-24 Organised by Shivaji Park CPE Study Circle of ICAI on 29/01/2022."
  },
  {
    "Faculty": "CA Prasanna Tambe",
    "Achievement Type": "Co-Curricular",
    "Details": "Attended a Four-day Online Workshop on Research Writing Organised by SIES CTD collaboration with Ph.D. Centre of SIES College of Commerce and Economics on 10/12/2021, 17/12/2021, 22/12/2021 and 23/12/2021."
  },
  {
    "Faculty": "Mr. Amit Khatri",
    "Achievement Type": "Personal",
    "Details": "Attended a course on MACHINE LEARNING MASTERS Organised by iNeuron from 20/11/2020 to 17/07/2021."
  },
  {
    "Faculty": "Mr. Amit Khatri",
    "Achievement Type": "Personal",
    "Details": "Attended FDP at Ramanujan College under the Ministry of Education, Pandit Madan Mohan Malaviya National Mission on Teachers and Teaching from 08/07/2021 to 14/07/2021."
  },
  {
    "Faculty": "Mr. Amit Khatri",
    "Achievement Type": "Personal",
    "Details": "Attended a webinar on the theme CYBER CRIME organised by SIES Central Training Department on 31/07/2021."
  },
  {
    "Faculty": "Mr. Amit Khatri",
    "Achievement Type": "Personal",
    "Details": "Attended a webinar on DATA SCIENCE AND APPLICATIONS IN BUSINESS Organised by Higher Education Forum on 28/08/2021."
  },
  {
    "Faculty": "Mr. Amit Khatri",
    "Achievement Type": "Personal",
    "Details": "Attended a National Level FDP on Managing Online Classes Organised by CLARAS COLLEGE OF COMMERCE on 09/09/2021."
  },
  {
    "Faculty": "Mr. Amit Khatri",
    "Achievement Type": "Personal",
    "Details": "Attended a workshop on RECENT ADVANCEMENTS IN RESEARCH METHODOLOGY Organised by Narsee Monjee College of Commerce and Economics from 04/09/2021 to 09/09/2021."
  },
  {
    "Faculty": "Mr. Amit Khatri",
    "Achievement Type": "Personal",
    "Details": "Attended a National Level Workshop on EXCELLING USING EXCEL - Pathway to Learn Different Tools & Techniques Organised by LALA Lajpatrai College of Commerce and Economics on 03/12/2021."
  },
  {
    "Faculty": "Mr. Amit Khatri",
    "Achievement Type": "Personal",
    "Details": "Attended an online workshop on BASIC ECONOMETRICS TOOLS AND TECHNIQUES Organised by Department of Economics, University of Allahabad from 27/01/2022 to 31/01/2022."
  },
  {
    "Faculty": "Dr. Amit Khatri",
    "Achievement Type": "Co-Curricular",
    "Details": "Attended a webinar on How to Write Research Paper - A Beginners Approach conducted by IT Department of SIES College of Commerce and Economics on 22/02/2022."
  },
  {
    "Faculty": "CS Charul Patel",
    "Achievement Type": "Personal",
    "Details": "Co-authored Textbook by Sheth Publishers in the subject of Accountancy & Financial Management – I for FYBCOM, September 2021, ISBN 978-93-87877-39-9."
  },
  {
    "Faculty": "CS Charul Patel",
    "Achievement Type": "Personal",
    "Details": "Co-authored Textbook by Sheth Publishers in the subject of Accountancy & Financial Management – II for FYBCOM for SEM II, January 2022, ISBN 978-93-89284-32-4."
  },
  {
    "Faculty": "CS Charul Patel",
    "Achievement Type": "Personal",
    "Details": "Attended an International Conference on Accounting, Auditing, Finance & Taxation (ICAAFT21) Organised by Kandivali Education Societys B. K. Shroff College of Arts & M. H. Shroff College of Commerce Kandivali (W) on 02/12/2021."
  },
  {
    "Faculty": "CS Charul Patel",
    "Achievement Type": "Personal",
    "Details": "Presented a paper titled A Study on awareness about Health Insurance Plans & Policies among Undergraduate College students in Mumbai at Online Multidisciplinary National Conference on Recent Trends & Developments in Science, Technology, Social Science & Management Organised by Vivekananda College of Arts, Science & Commerce, Chembur, Mumbai on 07/12/2021."
  },
  {
    "Faculty": "CS Charul Patel",
    "Achievement Type": "Personal",
    "Details": "Presented a paper titled Health Insurance awareness – A Study of Undergraduate College Students in Mumbai City at One Day Multidisciplinary International E-Conference on Innovation and Sustainability – Revitalizing Business Practices Through Quality Assurance & Inclusivity organized by Thakur College of Science & Commerce, Kandivali, Mumbai on 18/02/2022."
  },
  {
    "Faculty": "CS Charul Patel",
    "Achievement Type": "Personal",
    "Details": "Published a paper in March 2022 with Impact factor 7.36, page no. 106-113."
  },
  {
    "Faculty": "Ms. Priti Thakkar",
    "Achievement Type": "Personal",
    "Details": "Attended one day workshop of syllabus revision of Environmental Studies (Semester II), Mumbai University Board of Study Geography, Shikshan Maharshi Dadasaheb Limaye Arts Commerce And Science College, Kalamboli and D.G. Tatkare Mahavidyalaya ,Mangaon on 04/02/2022."
  },
  {
    "Faculty": "Ms. Priti Thakkar",
    "Achievement Type": "Personal",
    "Details": "Presented a paper titled Role of Religious centres in development of Kalwan district of Nashik in National Level Online Seminar on Population, Society, Development and Environmental Sustainability organized by Department of Geography and IQAC in collaboration with the Bombay Geographical Association on 19/04/2022."
  },
  {
    "Faculty": "Ms. Priti Thakkar",
    "Achievement Type": "Personal",
    "Details": "Published the paper on Development Of Tourism In Nashik District: A Geographical Analysis in Peer Reviewed referred- Educreator Research Journal, Vol-IX, March- April 2022, SJIF Impact Factor 7.717, ISSN P-2455-0515."
  },
  
    {
      "Faculty": "Dr. Swati Suryanarayanan",
      "Achievement Type": "Personal",
      "Details": "Attended a one-week Faculty Development programme on Intellectual Property Rights and its Application organised by Jharkhand Rai University, Ranchi in association with Institutions Innovation Council from 19/07/2021 to 24/07/2021."
    },
    {
      "Faculty": "Dr. Swati Suryanarayanan",
      "Achievement Type": "Personal",
      "Details": "Completed a Short-Term Course organised by UGC-HRDC Mumbai on Outcome Based Education for Teacher Effectiveness from 30/08/2021 to 04/09/2021."
    },
    {
      "Faculty": "Dr. Swati Suryanarayanan",
      "Achievement Type": "Personal",
      "Details": "Presented and awarded for the Best Research Paper titled 'Artificial Intelligence in E-Commerce with special reference to Chatbots – The Way Forward' at an International Conference organised by Achievers College of Commerce & Management on 16/02/2022."
    },
    {
      "Faculty": "Dr. Swati Suryanarayanan",
      "Achievement Type": "Personal",
      "Details": "Published a research paper titled 'The Success Story Of Amul: Benchmark For Crises Management During The Covid-19' in the International Journal Of Research In Commerce, IT & Management: Volume 12 (2022), Issue 2 (February), ISSN 2231-5756."
    },
    {
      "Faculty": "Dr. Harini C",
      "Achievement Type": "Personal",
      "Details": "Published a paper titled 'Offline to Online: A Long Way to Go' on the theme Technology in Education in UGC Care Listed (List-1) peer-reviewed bi-annual journal with ISSN 2581-8325 in July 2021. Link: https://ncert.nic.in/pdf/publication/journalsandperiodicals/indianjournalofeducationaltechnology/IJET_July_2021_Volume3_Issue2.pdf"
    },
    {
      "Faculty": "Dr. Harini C",
      "Achievement Type": "Personal",
      "Details": "Appointed as a member of the Board of Studies of Disability Studies, University of Mumbai."
    },
    {
      "Faculty": "Dr. Harini C",
      "Achievement Type": "Personal",
      "Details": "Selected as a reviewer of E-learning and Digital Media journal published by Sage."
    },
    {
      "Faculty": "Dr. Harini C",
      "Achievement Type": "Co-Curricular",
      "Details": "Convenor of organising committee for International Seminar on Redefining Organisational Behaviour in the New Normal jointly organised by IQAC & BOS Psychology SIES College of Commerce and Economics on 24/01/2022."
    },
    {
      "Faculty": "Dr. Harini C",
      "Achievement Type": "Personal",
      "Details": "Invited as a Judge at the Research Paper Presentation Competition on Innovations in the Financial Markets conducted by the BCom FM department, SIES College of Commerce and Economics, Sion (East) on 17/02/2022."
    },
    {
      "Faculty": "Ms. Alka Kharbanda",
      "Achievement Type": "Personal",
      "Details": "Attended a FDP on the theme 'Technical Analysis – Power of Candlestick Trading' organised by SIES College of Commerce and Economics in collaboration with CMT Association, New York and Vantage Knowledge Academy Limited from 13/12/2021 to 14/12/2021."
    },
    {
      "Faculty": "Ms. Alka Kharbanda",
      "Achievement Type": "Co-Curricular",
      "Details": "Invited as a Judge at the Research Paper Presentation Competition on Innovations in the Financial Markets conducted by the BCom FM department, SIES College of Commerce and Economics, Sion (East) on 17/02/2022."
    },
    {
      "Faculty": "Ms. Alisha Liz Varghese",
      "Achievement Type": "Personal",
      "Details": "Published a paper titled 'Offline to Online: A Long Way to Go' on the theme Technology in Education in UGC Care Listed (List-1) peer-reviewed bi-annual journal with ISSN 2581-8325 in July 2021. Link: https://ncert.nic.in/pdf/publication/journalsandperiodicals/indianjournalofeducationaltechnology/IJET_July_2021_Volume3_Issue2.pdf"
    },
    {
      "Faculty": "Ms. Alisha Liz Varghese",
      "Achievement Type": "Personal",
      "Details": "Attended a webinar on the theme 'Nurturing Entrepreneurial Ecosystem in Undergraduate Colleges' organised by Nagindas Khandwala College- IQAC and RUSA, Maharashtra on 09/07/2021."
    },
    {
      "Faculty": "Ms. Sophia Joseph",
      "Achievement Type": "Personal",
      "Details": "Invited as a Judge for Mr. and Miss BBI event by B.Com (Banking & Insurance) department in our college on 09/09/2021."
    },
    {
      "Faculty": "Ms. Sophia Joseph",
      "Achievement Type": "Personal",
      "Details": "Invited as a Judge for Survivors Battle event under Buddhi, by Bachelor of Management Studies department in our college on 15/01/2022."
    },
    {
      "Faculty": "Ms. Sophia Joseph",
      "Achievement Type": "Personal",
      "Details": "Published a research paper on the theme 'Digital Amnesia – A New Normal Amongst Millennials in Mumbai' in the conference at S K College, Nerul on 26/03/2022 and won the Best Research Paper Award."
    },
    {
      "Faculty": "Ms. Shruthi Sadanandan",
      "Achievement Type": "Personal",
      "Details": "Invited as a Judge for Mr. and Miss BBI event by B.Com (Banking & Insurance) department in our college on 09/09/2021."
    },
    {
      "Faculty": "Ms. Shruthi Sadanandan",
      "Achievement Type": "Personal",
      "Details": "Attended a one-day National Webinar on 'Social Start-Ups: Plethora of Opportunities for Young Entrepreneurs' organised by S.B.J.S. Rampuria Jain College, Bikaner on 10/07/2021."
    },
    {
      "Faculty": "Ms. Shruthi Sadanandan",
      "Achievement Type": "Personal",
      "Details": "Attended a five-day National Level Workshop on 'Recent Advancements in Research Methodology' organised by Narsee Monjee College of Commerce and Economics from 04/09/2021 to 09/09/2021."
    },
    {
      "Faculty": "Ms. Shruthi Sadanandan",
      "Achievement Type": "Personal",
      "Details": "Attended an Online National Level 10-day Faculty Development Program on 'IBM Statistical Package and Structural Equation Modeling with AMOS' organised by Rizvi College of Arts, Science and Commerce in collaboration with KC College from 03/12/2021 to 12/12/2021."
    },
    {
      "Faculty": "Ms. Shruthi Sadanandan",
      "Achievement Type": "Personal",
      "Details": "Attended AICTE Training and Learning (ATAL) Academy Online Advanced FDP on 'Sustainable Business Eco-System' organised by National Institute of Technology, Rourkela from 10/01/2022 to 14/01/2022."
    },
    {
      "Faculty": "Ms. Shruthi Sadanandan",
      "Achievement Type": "Personal",
      "Details": "Attended an Online 5-day Workshop on 'Research Methodology' conducted by Research Cell & IQAC of Shailendra Education Society's Arts, Commerce and Science College from 01/02/2022 to 05/02/2022."
    },
    {
      "Faculty": "Mr. Aniket Swaraj",
      "Achievement Type": "Personal",
      "Details": "Attended a webinar on 'New Education Policy in Higher Education – Context and Perspectives' organised by RUSA Maharashtra and VPM's K.G. Joshi College of Arts and N.G. Bedekar College of Commerce (Autonomous) from 01/07/2021 to 07/09/2021."
    },
    {
      "Faculty": "Mr. Aniket Swaraj",
      "Achievement Type": "Personal",
      "Details": "Attended a FDP on 'Wealth Creation & Investment Monetization' organised by Bombay Stock Exchange Brokers Forum from 24/08/2021 to 26/08/2021."
    },
    {
      "Faculty": "Mr. Aniket Swaraj",
      "Achievement Type": "Personal",
      "Details": "Attended a webinar on 'Guidance on Course Outcome, Program Outcome & Program Specific Outcome' organised by Reena Mehta College of Arts, Science, Commerce and Management Studies on 24/09/2021."
    },
    {
      "Faculty": "Ms. Manasi Shah",
      "Achievement Type": "Personal",
      "Details": "Completed a certificate course on Social Psychology by Wesleyan University through Coursera on 11/06/2021."
    },
    {
      "Faculty": "Ms. Manasi Shah",
      "Achievement Type": "Personal",
      "Details": "Attended a webinar on Cyber-crime conducted by Adv. Nandini Menon and organised by SIES Central Training on 25/09/2021."
    },
    {
      "Faculty": "Ms. Manasi Shah",
      "Achievement Type": "Personal",
      "Details": "Attended a 2-day National Level Workshop on 'Research Process and Research Writing' organised by Lala Lajpatrai College of Commerce & Economics on 20/11/2021 and 21/11/2021."
    },
    {
      "Faculty": "Ms. Manasi Shah",
      "Achievement Type": "Personal",
      "Details": "Attended a FDP on 'Portfolio Management' by Bombay Stock-Exchange Brokers Forum organised by Shri Ram College of Commerce, Arts and Science from 22/11/2021 to 26/11/2021."
    },
    {
      "Faculty": "Ms. Manasi Shah",
      "Achievement Type": "Personal",
      "Details": "Participated in a Two-Day National Symposium on 'Best Practices in Higher and Technical Education' organised by Vidyalankar Institute of Technology IQAC in association with NAAC, Bengaluru on 28/04/2022 and 29/04/2022."
    },
    {
      "Faculty": "Ms. Manasi Shah",
      "Achievement Type": "Co-Curricular",
      "Details": "Participated in a Two-day workshop on 'Professionalism at Workplace' organised by IQAC, SIESCE and SIES Central Training Department on 21/04/2022 and 22/04/2022."
    },
    {
      "Faculty": "Ms. Manasi Shah",
      "Achievement Type": "Co-Curricular",
      "Details": "Participated in the Faculty Exchange Programme organised by BMS Department of SIESCE in collaboration with DES’s Kirti M. Doongursee College of Arts, Science & Commerce for BMS Sem II students from 14/03/2022 to 17/03/2022."
    },
    {
      "Faculty": "Ms. Fleur Fernandes",
      "Achievement Type": "Personal",
      "Details": "Participated in One-Day National Webinar on 'Nurturing Entrepreneurial Ecosystem in Undergraduate Colleges' organised by RUSA and Nagindas Khandwala College on 09/07/2021."
    },
    {
      "Faculty": "Ms. Fleur Fernandes",
      "Achievement Type": "Personal",
      "Details": "Delivered a session on 'How to Find Internships and Ace Them!' organised by the Career Guidance and Placement Cell of Dnyan Ganga Education Trust's Degree College of Arts, Commerce and Science on 20/09/2021."
    },
    {
      "Faculty": "Ms. Fleur Fernandes",
      "Achievement Type": "Personal",
      "Details": "Attended a webinar on Cybercrime conducted by Adv. Nandini Menon, organised by Central Training Department, The South Indian Education Society on 16/10/2021."
    },
    
      {
        "Faculty": "Ms Fleur Fernandes",
        "Achievement Type": "Co-Curricular",
        "Details": "Was invited as Resource Person for conducting webinar for students on How to Find Internships and Ace Them! Organised by SIES (Nerul) College of Arts, Science and Commerce and SIES Central Training on 28/10/2021."
      },
      {
        "Faculty": "Ms Fleur Fernandes",
        "Achievement Type": "Co-Curricular",
        "Details": "Attended webinar on Awareness on Diabetes by Dr. Pradeep Mahajan, organised by Central Training Department, The South Indian Education Society on 13/11/2021."
      },
      {
        "Faculty": "Ms Fleur Fernandes",
        "Achievement Type": "Co-Curricular",
        "Details": "Attended Online Program on Citation Management Software - Mendeley conducted by Dr. Sarika Sawant organised by SIES College of Management Studies - Library Committee and SIES Central Training on 03/12/2021."
      },
      {
        "Faculty": "Ms Fleur Fernandes",
        "Achievement Type": "Personal",
        "Details": "Attended the Felicitation Ceremony of Internshala Annual Rankings 2021, held on 29/01/2022 for being ranked 54 among 1500 participating colleges for highest number of internships obtained through Internshala."
      },
      {
        "Faculty": "Ms Fleur Fernandes",
        "Achievement Type": "Personal",
        "Details": "Attended 5 day online workshop on Research Methodology conducted by Research Cell & IQAC of Shailendra Education Society's Arts, Commerce and Science College held from 01/02/2022 to 05/02/2022."
      },
      {
        "Faculty": "Ms Fleur Fernandes",
        "Achievement Type": "Co-Curricular",
        "Details": "Presented research paper in National Conference on Innovations in Financial Markets organised by SIES College of Commerce and Economics on 17/02/2022, which was adjudged as Best Paper in Faculty category."
      },
      {
        "Faculty": "Ms Fleur Fernandes",
        "Achievement Type": "Co-Curricular",
        "Details": "Authored an article titled Work Attitudes for Growth and Excellence published in Adhigam (Vol-V, Issue-III, Jan-Aug 2021), e-magazine of SIES Central Training Department."
      },
      {
        "Faculty": "Ms Fleur Fernandes",
        "Achievement Type": "Personal",
        "Details": "Appointed as Member of Maharashtra Training and Placement Officers Association (MATPO) for the year 2021."
      },
      {
        "Faculty": "Ms Fleur Fernandes",
        "Achievement Type": "Personal",
        "Details": "Participated in 3 days Case Writing Workshop organised from 24/02/2022 to 26/02/2022 by Association of Indian Management Schools (AIMS)."
      },
      {
        "Faculty": "Ms Fleur Fernandes",
        "Achievement Type": "Personal",
        "Details": "Published and Presented research paper titled Internship Satisfaction and Resilience among Management Students in Mumbai, for the One Day National Conference on Resilient India: The New Way Forward organized by S.K. College of Science & Commerce, Navi Mumbai on 26/03/2022."
      },
      {
        "Faculty": "Ms Fleur Fernandes",
        "Achievement Type": "Personal",
        "Details": "Attended webinar on Scales of Measurement on 22/03/2022 by Research Cell of Cosmopolitan’s Valia College."
      },
      {
        "Faculty": "Ms Fleur Fernandes",
        "Achievement Type": "Personal",
        "Details": "Attended APAC Train the Trainer Masterclass March/April 2022 Conducted by Akila Gunarathna, Wisdom Business Academy organised by AICPA & CIMA."
      },
      {
        "Faculty": "Ms Fleur Fernandes",
        "Achievement Type": "Personal",
        "Details": "Published research paper on A Study on Sustainability of Green Buildings in Real Estate in International Journal of Advance and Innovative, 22-24, Volume 9, Issue 1 (XI) January - March 2022 ISSN 2394 – 7780."
      },
      {
        "Faculty": "Ms Fleur Fernandes",
        "Achievement Type": "Personal",
        "Details": "Published research paper on Sustainability of the Automobile Industry in International Journal of Advance and Innovative, Volume 9, Issue 1 (XI), January - March 2022 ISSN 2394 - 7780."
      },
      {
        "Faculty": "Ms Fleur Fernandes",
        "Achievement Type": "Personal",
        "Details": "Published research paper on A study on sustainability of generic drugs with reference to Pradhamantri Janaushadhi Yojana in International Journal of Advance and Innovative, Volume 9, Issue 1 (XI), January - March 2022 ISSN 2394 - 7780."
      },
      {
        "Faculty": "Ms Fleur Fernandes",
        "Achievement Type": "Personal",
        "Details": "Published research paper on A Sustainable Tourism in India in International Journal of Advance and Innovative, Volume 9, Issue 1 (XI), January - March 2022 ISSN 2394 - 7780."
      },
      {
        "Faculty": "Mr. Vinayak Krishnan",
        "Achievement Type": "Co-Curricular",
        "Details": "Attended an online webinar on the theme Cyber Crime organised by Central Training Department of SIES on 25/09/2021."
      },
      {
        "Faculty": "Mr. Vinayak Krishnan",
        "Achievement Type": "Co-Curricular",
        "Details": "Attended an online webinar on the theme Investments organised by Central Training Department of SIES on 23/10/2021."
      },
      {
        "Faculty": "Mr. Vinayak Krishnan",
        "Achievement Type": "Personal",
        "Details": "Attended a workshop on the theme Research Process and Research Writing organised by Lala Lajpatrai College of Commerce and Economics from 20/11/2021 to 21/11/2021."
      },
      {
        "Faculty": "Mr. Vinayak Krishnan",
        "Achievement Type": "Co-Curricular",
        "Details": "Attended a FDP on the theme Technical Analysis – Power of Candlestick trading organised by SIES College of Commerce and Economics in collaboration with CMT Association, New York and Vantage Knowledge Academy Limited from 13/12/2021 to 14/12/2021."
      },
      {
        "Faculty": "Mr. Vinayak Krishnan",
        "Achievement Type": "Co-Curricular",
        "Details": "Attended a workshop on the theme Research Methodology organised by Shailendra Education Society's Arts, Science and Commerce College from 01/02/2022 to 05/02/2022."
      },
      {
        "Faculty": "Mr. Vinayak Krishnan",
        "Achievement Type": "Co-Curricular",
        "Details": "Conducted a Training Programme for the College Support Staff on the topic Financial Planning for Short to Medium Term along with live examples and model portfolio on 06/04/2022."
      },
      {
        "Faculty": "Dr. Anoushka Mirgnani",
        "Achievement Type": "Personal",
        "Details": "Awarded PhD for the thesis titled A study on Emotional Labour and its Impact on Productivity of Faculties at Undergraduate Level with special reference to Mumbai Metropolitan Region from JJT University on 19/07/2021."
      },
      {
        "Faculty": "Ms. Mamta Pandey",
        "Achievement Type": "Personal",
        "Details": "Attended a webinar on the theme Cyber Crime organised by Central Training Department of SIES on 25/09/2021."
      },
      
        {
          "Faculty": "Ms. Mamta Pandey",
          "Achievement Type": "Co-Curricular",
          "Details": "Attended Online Workshop - Dos and Donts of Research and Technical Publications Organised by the Central Training Department of SIES, on 06/02/2022, 13/02/2022, 19/02/2022 and 27/02/2022."
        },
        {
          "Faculty": "Ms. Mamta Pandey",
          "Achievement Type": "Personal",
          "Details": "Attended a national webinar on Systematic approach for publishing papers, indexing and Citations organised by Shri Ram College of Commerce on 18/02/2022."
        },
        {
          "Faculty": "Ms Narmeta Vanita Narahari",
          "Achievement Type": "Co-Curricular",
          "Details": "Attended Online Webinar on Cyber Crime on 25th September 2021 Organised by Central Training Department of SIES."
        },
        {
          "Faculty": "Ms Dipali Patil",
          "Achievement Type": "Co-Curricular",
          "Details": "Attended a webinar on the theme Cyber Crime Organised by Central Training Department of SIES on 25/09/2021."
        },
        {
          "Faculty": "Ms Dipali Patil",
          "Achievement Type": "Personal",
          "Details": "Attended Online Workshop - Dos and Donts of Research and Technical Publications Organised by the Central Training Department of SIES, on 06/02/2022,13/02/2022, 19/02/2022 and 27/02/2022."
        },
        {
          "Faculty": "Ms Dipali Patil",
          "Achievement Type": "Personal",
          "Details": "Attended a national webinar on Systematic approach for publishing papers, indexing and Citations organised by Shri Ram College of Commerce on 18/02/2022."
        },
        {
          "Faculty": "Ms Dipali Patil",
          "Achievement Type": "Personal",
          "Details": "Attended 3 Days Faculty Development Programme organised by BMS Department of Bharatiya Vidya Bhavans Hazarimal Somani College of Arts and Science, Shri Manubhai Maneklal Sheth Junior College of Arts and Science and Jayaramdas Patel College of Commerce and Management Studies, Chowpatty, Mumbai, in Association with Career Prof from 23/02/2022 to 25/02/2022."
        },
        {
          "Faculty": "CA Chandrashekhar Sawant",
          "Achievement Type": "Personal",
          "Details": "Completed Short Term Course (online) on E-filing and Statutory Compliances to Tax Laws sponsored by RUSA Organised by Birla College with University of Mumbai under UGC –HRDC from 29/12/2021 to 04/01/2022."
        },
        {
          "Faculty": "CA Chandrashekhar Sawant",
          "Achievement Type": "Personal",
          "Details": "Completed online Two - Week Interdisciplinary Refresher Course on Research Methodology from 22/12/2021 to 05/01/2022 conducted by Teaching Learning Centre, Ramanujan College, University of Delhi under the aegis of Ministry of Education, Pandit Mandan Mohan Malaviya National Mission on Teachers and Teaching and obtained Grade A."
        },
        {
          "Faculty": "CA Chandrashekhar Sawant",
          "Achievement Type": "Personal",
          "Details": "Appointed as Vice Chancellors Nominee on Board of Studies in Master of Commerce (Advanced Accountancy) of Tolani College of Commerce (Autonomous), Andheri East , Mumbai."
        },
        {
          "Faculty": "CA Chandrashekhar Sawant",
          "Achievement Type": "Personal",
          "Details": "Completed Master in Management Studies (Finance) from ICFAI (Foundation for Higher Education Hyderabad) in June 2021."
        },
        {
          "Faculty": "CA Chandrashekhar Sawant",
          "Achievement Type": "Personal",
          "Details": "Attended the Five-day online workshop on RESEARCH METHODOLOGY conducted by Research Cell & IQAC of Shailendra Education Societys Arts, Commerce and Science College held from 01/02/2022 to 05/02/2022."
        },
        {
          "Faculty": "CA Chandrashekhar Sawant",
          "Achievement Type": "Personal",
          "Details": "Presented and Published paper Investors perception towards start-ups in India as Investment Avenue at Childrens Welfare Centres Claras College of Commerce, Andheri, Mumbai at One Day International Multidisciplinary E-Conference on Impact of Covid -19 on Sustainable Development on 20/12/2021."
        },
        {
          "Faculty": "Ms Payal Vijay Bhatia",
          "Achievement Type": "Personal",
          "Details": "Attended a one-day workshop on An Insight into CAS and its recent amendments in accordance with 7th Pay Commission Organised by Prahladrai Dalmia Lions College of Commerce and Economics in association with University of Mumbai held on 24/07/2021."
        },
        {
          "Faculty": "Ms Payal Vijay Bhatia",
          "Achievement Type": "Personal",
          "Details": "Attended a one-day National Level Faculty Development Program on Research Paper writing: Abstract to Conclusions for Quality Journals (ABDC, SCOPUS, Hi-Index) organised by Akbar Peerbhoy College of Commerce and Economics on 13/09/2021."
        },
        {
          "Faculty": "Ms Payal Vijay Bhatia",
          "Achievement Type": "Co-Curricular",
          "Details": "Attended a Webinar on Cyber-crime organised by SIES Central Training on 25/09/2021."
        },
        {
          "Faculty": "Ms Payal Vijay Bhatia",
          "Achievement Type": "Personal",
          "Details": "Attended 7 days National Level Management Development Program organised by Department of Management, Bhopal School of Social Sciences from 20/11/2021 to 27/11/2021."
        },
        {
          "Faculty": "CA Darshak Doshi",
          "Achievement Type": "Personal",
          "Details": "Successfully Completed a Four -Week Induction/Orientation Programme for Faculty in Universities/Colleges/Institutes of Higher Education from 19/06/2021 – 18/07/2021 conducted by Teaching Learning Centre, Ramanujan College, University of Delhi under the aegis of Ministry of Education and obtained Grade A+."
        },
        {
          "Faculty": "CA Darshak Doshi",
          "Achievement Type": "Personal",
          "Details": "Successfully Completed online Two - Week Inter-disciplinary Refresher Course/Faculty Development Programme On Managing Online Classes & Co- Creating MOOCS 6.0 from 05/07/2021 – 19/07/2021 conducted by Teaching Learning Centre, Ramanujan College, University of Delhi and obtained Grade A+."
        },
        {
          "Faculty": "CA Darshak Doshi",
          "Achievement Type": "Personal",
          "Details": "Presented a Research Paper on A Study On Awareness Level Of Investment Through Systematic Plans In Mutual Funds Amongst People Residing In Mumbai Metropolitan Region in an International Conference on Unlocking the Potential of Post-Covid Digital Transformations in Management organised by IQAC and Department of BMS of SVKMS Usha Pravin Gandhi College Of Arts, Science And Commerce on 06/08/2021. Paper Published in Contemporary Perspectives in Management - ISBN : 978-81-952196-8-1 (Page No 71–77)."
        },
        {
          "Faculty": "CA Darshak Doshi",
          "Achievement Type": "Personal",
          "Details": "Attended an FDP on Technical Analysis – Power of Candlestick trading organised by SIES College of Commerce and Economics in collaboration with CMT Association, New York and Vantage Knowledge Academy Limited from 13/12/2021 to 14/12/2021."
        },
        {
          "Faculty": "CA Darshak Doshi",
          "Achievement Type": "Personal",
          "Details": "Successfully Completed 2 Weeks Online International Faculty Development Programme from 14/06/2021 to 25/06/2021 on Communication Skills: Theory & Practices organised by Department of Languages Integral University Lucknow, India."
        },
        {
          "Faculty": "CA Darshak Doshi",
          "Achievement Type": "Co-Curricular",
          "Details": "Conducted a Training Programme for the College Support Staff on the topic Introduction to Financial Planning and Goal Setting on 04/04/2022."
        },
        {
          "Faculty": "Ms Shailashri Uchil",
          "Achievement Type": "Personal",
          "Details": "Completed One week FDP on New education policy in Higher education - context and perspective from 01/07/2021 to 07/07/2021 conducted by RUSA Maharashtra in association with VPMS KG Joshi College of Arts and N.G. Bedekar College of Commerce (Autonomous) and Ramanand Arya DAV College (Autonomous)."
        },
        {
          "Faculty": "Ms Shailashri Uchil",
          "Achievement Type": "Co-Curricular",
          "Details": "Attended a Webinar on Cyber-crime organised by SIES Central Training on 25/09/2021."
        },
        {
          "Faculty": "Ms Shailashri Uchil",
          "Achievement Type": "Personal",
          "Details": "Invited as a Judge at the Research Paper Presentation Competition on Innovations in the Financial Markets conducted by the BCom FM department, SIES College of Commerce and Economics, Sion (East) on 17.02.2022."
        },
        {
          "Faculty": "Ms Shailashri Uchil",
          "Achievement Type": "Personal",
          "Details": "Attended an online faculty development programme on Effective Teaching through Information and Communication Technology from 14/02/2022 to 18/02/2022 at JJTU, Rajasthan."
        },
        {
          "Faculty": "Ms Shailashri Uchil",
          "Achievement Type": "Personal",
          "Details": "Received the Best Research Paper Award at the one-day international conference on Envisioning a Sustainable Future on 25th April 2022 at KPB Hinduja College."
        },
        {
          "Faculty": "Mr. Abhijit Bhosale",
          "Achievement Type": "Personal",
          "Details": "Presented and published a paper titled Understanding the Factors Influencing Street Vendors towards Use of Digital Payment Systems in India on the theme Challenges, Opportunities in Technology and Innovative Management Practices - A Futuristic Approach till 2050 Organised by Ideal Institute of Management and Technology College on 26/08/2021, in IEEE Xplore doi: 10.1109/ICRITO51393.2021.959631."
        },
        {
          "Faculty": "Mr. Abhijit Bhosale",
          "Achievement Type": "Personal",
          "Details": "Presented and published a paper titled Evaluation Of The Longevity, Hedging And Safe Haven Characteristics Of Bitcoin Based On Recent Trends, And a Study Of Central Bank Digital Currencies As An Alternative To Cryptocurrencies organised by Marudhara College, Bikaner, Rajasthan on 04/08/2021, in UGC Care List II/Web of Science journal Vidybharti International Interdisciplinary Research Journal with ISBN/ISSN 2319 - 4979."
        },
        {
          "Faculty": "Mr. Abhijit Bhosale",
          "Achievement Type": "Personal",
          "Details": "Presented and published a paper titled A Study Of Gender Perspectives In The Entrepreneurial Process With Respect To Ideation, Planning, Performance Evaluation And Differentiation Measures organised by Chandrabhan Sharma College, Mumbai on 04/09/2021, in UGC Care List II/Web of Science journal Vidybharti International Interdisciplinary Research Journal with ISBN/ISSN 2319 - 4979."
        },
        
          {
            "Faculty": "Mr. Abhijit Bhosale",
            "Achievement Type": "Personal",
            "Details": "Awarded Best Paper for a paper titled 'Understanding the Factors Influencing Street Vendors towards Use of Digital Payment Systems in India' on the theme 'Challenges, Opportunities in Technology and Innovative Management Practices - A Futuristic Approach till 2050' organised by Ideal Institute of Management and Technology College on 26/08/2021, in IEEE Xplore doi: 10.1109/ICRITO51393.2021.959631"
          },
          {
            "Faculty": "Mr. Abhijit Bhosale",
            "Achievement Type": "Personal",
            "Details": "Successfully completed a 7 day International Professional Development Program on 'Strategies for Effective Classroom Teaching' hosted by Patrician College of Arts and Science from 26/07/2021 to 01/08/2021"
          },
          {
            "Faculty": "Mr. Abhijit Bhosale",
            "Achievement Type": "Personal",
            "Details": "Successfully completed a Two Week Interdisciplinary Refresher Course on 'Research Methodology' conducted by Teaching Learning Centre, Ramanujan College, University of Delhi under the aegis of the Ministry of Education from 22/12/2021 to 05/01/2022 with A+ Grade."
          },
          {
            "Faculty": "Mr. Abhijit Bhosale",
            "Achievement Type": "Personal",
            "Details": "Invited as an external examiner for Equity Markets and Debt Markets Exam/Assessment by HR College of Commerce and Economics during January 2022."
          },
          {
            "Faculty": "Mr. Abhijit Bhosale",
            "Achievement Type": "Co-Curricular",
            "Details": "Conducted a Training Programme for the College Support Staff on the topic 'Insurance and its Importance' on 04/04/2022."
          },
          {
            "Faculty": "Ms Falguni Mathews",
            "Achievement Type": "Personal",
            "Details": "Presented and published a paper titled 'A Study on Behaviour of Generation Y Towards Sustainable Initiatives Taken by Government and Companies' on the theme 'Thriving in Digital Era Innovation in Business, Science and Technology' organised by Oriental Institute of Management on 13/11/2021, in UGC Care Group 1 Journal Shodhsamhita, Volume No. VIII, Issue 2(II), 2021-2022 with ISSN 2277-7067."
          },
          {
            "Faculty": "Ms Falguni Mathews",
            "Achievement Type": "Personal",
            "Details": "Presented and published a paper titled 'To Examine the Impact of Digital Media Apps on Consumers Purchasing Habits in Mumbai' on the theme 'Research Conclave on Industry 4.0: A Virtual Event 2021' organised by M.L. Dahanukar College of Commerce on 04/10/2021, in UGC Care List Group II Journal Vidyabharti International Interdisciplinary Research Journal with ISSN 2319-4979."
          },
          {
            "Faculty": "Ms Falguni Mathews",
            "Achievement Type": "Personal",
            "Details": "Presented and published a paper titled 'Green HRM: A New Approach to Sustainable Environment' on the theme 'Sustainable Development: Environmental, Economic and Socio-Cultural Issues & Challenges' organised by Chandraban Sharma College of Arts, Science and Commerce on 04/09/2021, in UGC Care List - Asian Journal of Organic & Medicinal Chemistry Vol. 6 No. 4 (October - December, Special Issue 2021) with ISSN Online: 2456-8937."
          },
          {
            "Faculty": "Ms Falguni Mathews",
            "Achievement Type": "Personal",
            "Details": "Presented and published a paper titled 'Use of Digital Technology in Higher Education Institutions: Online Assessment and its Application' on the theme 'Pandemic Induced Creative Disruptions: Issues, Challenges, and Prospects' organised by S.M. Shetty College of Science, Commerce & Management Studies on 30/09/2021, in UGC Care List II Journal Web of Science: VB International Interdisciplinary Research Journal with ISSN: 2319-4979."
          },
          {
            "Faculty": "Ms Falguni Mathews",
            "Achievement Type": "Personal",
            "Details": "Presented and published a paper titled 'Understanding the factors influencing Street Vendors towards use of Digital Payment Systems in India' on the theme 'Challenges, Opportunities in Technology and Innovative Management Practices - A Futuristic Approach till 2050' organised by Ideal Institute of Management and Technology, Delhi on 26/08/2021 and 27/08/2021, in IEEE Xplore (Scopus Indexed), 9th International Conference on Reliability, Infocom Technologies and Optimization (Trends and Future Directions) - ISBN 978-1-6654-1703-7 https://ieeexplore.ieee.org/document/9596315/metrics#metrics – WON THE BEST RESEARCH PAPER AWARD."
          },
          {
            "Faculty": "Ms Falguni Mathews",
            "Achievement Type": "Personal",
            "Details": "Published a paper titled 'Digital Media: The Ascension of OTT Platform & Its Future Potential in India' on the theme 'Management Practices in Digital World' in the book by International Publisher Empyreal Publishing House with ISBN 978-81-952196-2-9 in the Month of October 2021."
          },
          {
            "Faculty": "Ms Falguni Mathews",
            "Achievement Type": "Personal",
            "Details": "Published a paper titled 'A Comparative Study Between Online Education and Offline Education' on the theme 'Management Practices in Digital World' in the book by International Publisher Empyreal Publishing House with ISBN 978-81-952196-2-9 in the Month of October 2021. Written with Bhavleen Kaur, Hetvi Chheda, Shweta Patel and Siddhi Maheshwari."
          },
          {
            "Faculty": "Ms Falguni Mathews",
            "Achievement Type": "Personal",
            "Details": "Published a paper titled 'A Study on The Impact of Covid-19 On Education of College Students in Mumbai City' on the theme 'Management Practices in Digital World' in the book by International Publisher Empyreal Publishing House with ISBN 978-81-952196-2-9 in the Month of October 2021. Written with Karishma Naidu, Sanjana Shetty, Padma Pillai and Mith Hiran."
          },
          {
            "Faculty": "Ms Falguni Mathews",
            "Achievement Type": "Personal",
            "Details": "Published a paper titled 'Artificial Intelligence in Tesla Cars' on the theme 'Management Practices in Digital World' in the book by International Publisher Empyreal Publishing House with ISBN 978-81-952196-2-9 in the Month of October 2021. Written with Khushal Mehra, Preetha Patil, Krishi Shah and Aryan Jain."
          },
          {
            "Faculty": "Ms Falguni Mathews",
            "Achievement Type": "Personal",
            "Details": "Published a paper titled 'Digital Transformation: A Study on Use of Digital Payment Among College Students in Mumbai City' on the theme 'Management Practices in Digital World' in the book by International Publisher Empyreal Publishing House with ISBN 978-81-952196-2-9 in the Month of October 2021. Written with Vatsal Doshi, Devanshi Kuradia, Saumya Avula and Ronak Puri."
          },
          {
            "Faculty": "Ms Falguni Mathews",
            "Achievement Type": "Personal",
            "Details": "Published a paper titled 'Students Mentality in Online Education During Covid 19' on the theme 'Management Practices in Digital World' in the book by International Publisher Empyreal Publishing House with ISBN 978-81-952196-2-9 in the Month of October 2021. Written with Vijay Devendra, Hardik Mahadik, Abinesh Nadar and Rohan Vig."
          },
          {
            "Faculty": "Ms Falguni Mathews",
            "Achievement Type": "Personal",
            "Details": "Presented and published a paper titled 'Study of Different Leadership Styles on Employees of Health Care Sector During Covid 19' on the theme 'Contemporary Perspectives in Management' organised by IQAC and Department of BMS of SVKM’s Usha Pravin Gandhi College of Arts, Science and Commerce on 6th August, 2021. Paper Published in 'Contemporary Perspectives in Management' by International Publisher Empyreal Publishing House with ISBN 978-81-952196-8-1 in the month of August 2021. Written with Bhavleen Kaur, Hetvi Chheda, Shweta Patel and Siddhi Maheshwari."
          },
          {
            "Faculty": "Ms Falguni Mathews",
            "Achievement Type": "Personal",
            "Details": "Presented and published a paper titled 'A Study on The Impact of Social Media Marketing on College Goers in Mumbai City' on the theme 'Contemporary Perspectives in Management' organised by IQAC and Department of BMS of SVKM’s Usha Pravin Gandhi College of Arts, Science and Commerce on 6th August, 2021. Paper Published in 'Contemporary Perspectives in Management' by International Publisher Empyreal Publishing House with ISBN 978-81-952196-8-1 in the month of August 2021. Written with Karishma Naidu, Sanjana Shetty, Padma Pillai and Mith Jain."
          },
          
            {
              "Faculty": "Ms Falguni Mathews",
              "Achievement Type": "Personal",
              "Details": "Presented and published a paper titled 'Meme Marketing: The New Era of Advertising' on the theme 'Contemporary Perspectives in Management' organised by IQAC and Department of BMS of SVKM’s Usha Pravin Gandhi College of Arts, Science and Commerce on 6th August, 2021. Paper Published in 'Contemporary Perspectives in Management' by International Publisher Empyreal Publishing House with ISBN 978-81-952196-8-1 in the month of August 2021. Written with Khushal Mehra, Preetha Patil, Nilkanth Tiwari and Krishi Shah."
            },
            {
              "Faculty": "Ms Falguni Mathews",
              "Achievement Type": "Personal",
              "Details": "Presented and published a paper titled 'Surrogate Advertisement & Its Effects on Consumer Behaviour' on the theme 'Contemporary Perspectives in Management' organised by IQAC and Department of BMS of SVKM’s Usha Pravin Gandhi College of Arts, Science and Commerce on 6th August, 2021. Paper Published in 'Contemporary Perspectives in Management' by International Publisher Empyreal Publishing House with ISBN 978-81-952196-8-1 in the month of August 2021. Written with Sahil Karunakaran, Chaitanya Patil, Anu Murugan and Berwyn Dmello."
            },
            {
              "Faculty": "Ms Falguni Mathews",
              "Achievement Type": "Personal",
              "Details": "Presented and published a paper titled 'A Study on The Impact of Marketing in Football' on the theme 'Contemporary Perspectives in Management' organised by IQAC and Department of BMS of SVKM’s Usha Pravin Gandhi College of Arts, Science and Commerce on 6th August, 2021. Paper Published in 'Contemporary Perspectives in Management' by International Publisher Empyreal Publishing House with ISBN 978-81-952196-8-1 in the month of August 2021. Written with Siddharth Bhardwaj, Sairaj Srinivasan, Vedant Rai and Shaunak Natraj."
            },
            {
              "Faculty": "Ms Falguni Mathews",
              "Achievement Type": "Personal",
              "Details": "Presented and published a paper titled 'Online Grocery Shopping During Covid 19 in Mumbai City' on the theme 'Contemporary Perspectives in Management' organised by IQAC and Department of BMS of SVKM’s Usha Pravin Gandhi College of Arts, Science and Commerce on 6th August, 2021. Paper Published in 'Contemporary Perspectives in Management' by International Publisher Empyreal Publishing House with ISBN 978-81-952196-8-1 in the month of August 2021. Written with Vijay Devendra, Hardik Mahadik, Abhinesh Nadar, Rohan Vig and Ms Falguni Mathews."
            },
            {
              "Faculty": "Ms Falguni Mathews",
              "Achievement Type": "Personal",
              "Details": "Co-authored a book on 'Retailing and Merchandising' for TYBAMMC by Rishabh Publishing House, with Dr. Rinkesh Chheda ISBN 978-93-5249-149-0."
            },
            {
              "Faculty": "Ms Falguni Mathews",
              "Achievement Type": "Personal",
              "Details": "Co-authored a book on 'Retail Management' for TYBMS by Rishabh Publishing House with Dr. Rinkesh Chheda ISBN 978-93-5249-145-2."
            },
            {
              "Faculty": "Ms Falguni Mathews",
              "Achievement Type": "Personal",
              "Details": "Co-authored a book on 'Production and Total Quality Management' for SYBMS by Rishabh Publishing House with Dr. Rinkesh Chheda, ISBN 978-93-5249-148-3."
            },
            {
              "Faculty": "Ms Falguni Mathews",
              "Achievement Type": "Personal",
              "Details": "Attended FDP on the theme 'Higher Education Policy in Higher Education – Context and Perspectives' organised by RUSA at VPM K.G. Joshi College of Arts and N.G. Bedekar College of Commerce and Ramanand Arya DAV College from 01/07/2021 to 07/07/2021."
            },
            {
              "Faculty": "Ms Falguni Mathews",
              "Achievement Type": "Personal",
              "Details": "Attended FDP on the theme 'Investors Awareness on Stock Market' organised by Thakur College of Science and Commerce from 05/07/2021 to 11/07/2021."
            },
            {
              "Faculty": "Ms Falguni Mathews",
              "Achievement Type": "Personal",
              "Details": "Attended FDP on the theme 'Ethical, Circular and Sustainable Fashion: Transdisciplinary Approaches' organised by Amity University from 12/07/2021 to 16/07/2021."
            },
            {
              "Faculty": "Ms Falguni Mathews",
              "Achievement Type": "Personal",
              "Details": "Attended a webinar on 'Overview of Securities Market and Latest Development' organised by BSE Investor Protection Funds on 20/07/2021."
            },
            {
              "Faculty": "Ms Falguni Mathews",
              "Achievement Type": "Personal",
              "Details": "Attended a workshop on 'An insight into Career Advancement Scheme and its recent amendments in accordance with the 7th Pay Commission' organised by Prahladrai Dalmia Lions College of Commerce and Economics on 24/07/2021."
            },
            {
              "Faculty": "Ms Falguni Mathews",
              "Achievement Type": "Personal",
              "Details": "Attended PDP on 'Strategies of Effective Classroom Teaching' organised by Patrician College of Arts and Science from 26/07/2021 to 01/08/2021."
            },
            {
              "Faculty": "Ms Falguni Mathews",
              "Achievement Type": "Personal",
              "Details": "Attended FDP on the theme 'Guidance on Course Outcome, Program Outcome and Program Specific Outcomes' organised by Reena Mehta College of Arts, Science and Commerce and Management Studies on 24/09/2021."
            },
            {
              "Faculty": "Ms Falguni Mathews",
              "Achievement Type": "Personal",
              "Details": "Member of organising committee for 'International Seminar on Redefining Organisational Behaviour in the New Normal' jointly organised by IQAC & BOS Psychology SIES College of Commerce and Economics on 24/01/2022."
            }

    ]
    
  
  