[
    {
      "date": "17th August 2019",
      "committee": "Rotract Club",
      "faculty": "Ms. Falguni Mathews",
      "details": "On the occasion of World Humanitarian Day we, the Rotaract Club of SIES Sion East had decided to visit Girls Inspired for Tomorrow (GIFT) NGO which is situated at Malad, on 17th August,2019. We had already done many events with them in the past years and we were more than delighted to do it again. We contacted them and spoke to them about the event which we wanted to do to which they had positively responded. The NGO was specifically for the girls. The kids in that NGO were of age 5-14.",
      "year": "2019-2020"
    },
    {
      "date": "16th August 2019",
      "committee": "N.S.S.",
      "faculty": "Dr. Rinkesh Chheda",
      "details": "On the day after Independence day, the NSS unit in collaboration with Khushiyaan foundation conducted `Save the flag' event at Dadar station and Sion station. 18 volunteers actively participated, where they collected the flags which were thrown by the people, in order to increase the value and increased the respect towards the national flag.",
      "year": "2019-2020"
    },
    {
      "date": "14th August 2019",
      "committee": "Internship Cell",
      "faculty": "Mrs. Fleur Fernandes",
      "details": "FineAns, a case study competition based on BMS subjects, was held for the finance students of SYBMS and TYBMS on 13th and 14th August, 2019. 110 students participated in the competition. The event was sponsored by Internship Cell.",
      "year": "2019-2020"
    },
    {
      "date": "14th August 2019",
      "committee": "N.S.S.",
      "faculty": "Dr. Rinkesh Chheda",
      "details": "The seminar was conducted by Mr. Sanju Kale (Mr. Black) who runs an NGO called `Mr. Black Waste Management Foundation'. He enlightened the volunteers on how to segregate the waste in their daily routine as well as the relevance of reduce, reuse and recycle.",
      "year": "2019-2020"
    },
    {
      "date": "13th August 2019",
      "committee": "N.S.S.",
      "faculty": "Dr. Rinkesh Chheda",
      "details": "The aim of eco-friendly bags is to reduce the dependence on plastics bags. Around 350 paper bags were made by the N.S.S students that were then distributed to various grocery shops.",
      "year": "2019-2020"
    },
    {
      "date": "11th August 2019",
      "committee": "Research Cell",
      "faculty": "Dr. Seethalekshmy. Narayana Iyer",
      "details": "This workshop was conducted for all degree college teachers across mumbai university",
      "year": "2019-2020"
    },
    {
      "date": "11th August 2019",
      "committee": "N.S.S.",
      "faculty": "Dr. Rinkesh Chheda",
      "details": "A group of 58 N.S.S volunteers, in collaboration with the 'Beach Warriors', a group who assiduously dedicate every weekend towards maintaining the pristine nature of beaches, picked garbage off Dadar beach and spread awareness about the issue of beach degradation.",
      "year": "2019-2020"
    },
    {
      "date": "9th August 2019",
      "committee": "N.S.S.",
      "faculty": "Dr. Rinkesh Chheda",
      "details": "The meaning of Raksha Bandhan is 'the tie or knot of protection' Keeping this in mind, the NSS unit of our college, in collaboration with Indian Society for Mentally disabled organized a rakhi selling event. The volunteers set up a stall in the college foyer wherein they sold rakhis, earrings, chocolates, etc prepared by the students of society.",
      "year": "2019-2020"
    },
    {
      "date": "6th August 2019",
      "committee": "N.S.S.",
      "faculty": "Dr. Rinkesh Chheda",
      "details": "On the eve of International Peace Day [Hiroshima day], the University of Mumbai in collaboration with the Sarvodaya Mandal organized a peace rally with a remark to remember the people who died on that fateful day. Our volunteers participated in the rally that started from Azad Maidan till the Hutatma chowk wherein the volunteers participated silently, with any slogans.",
      "year": "2019-2020"
    },
    {
      "date": "4th August 2019",
      "committee": "Rotract Club",
      "faculty": "Ms. Falguni Mathews",
      "details": "On day everyone reported at the venue by 8: am and started working by 8:30 am. We were given hand gloves and as refreshments we were given monster energy drink. We were accompanied by many volunteers from all around Mumbai. Well known celebrity Arjun Kapoor had shown his support by participating in this event. we all really enjoyed a lot and felt really proud to have worked for this cause. We clicked some pictures at the end of the event and had a few words with the representative of beach warriors. We left the location around 10 am.",
      "year": "2019-2020"
    },
    {
      "date": "2nd August 2019",
      "committee": "N.S.S.",
      "faculty": "Dr. Rinkesh Chheda",
      "details": "Our college launched a 'Plantation Programme' on the occasion of the World Environment Day in the locality of Thane, Mental hospital (regional). The N.S.S volunteers were highly enthusiastic to make it a big success and all 24 of them partook in planting saplings and watering the plants.",
      "year": "2019-2020"
    },
    {
      "date": "31st July 2019",
      "committee": "Iqac",
      "faculty": "Ms. Sangeeta Kore",
      "details": "Workshop on First Aid and Safety measures",
      "year": "2019-2020"
    },
    
        {
          "date": "30th July 2019",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "? On the event day, HP representatives reached college by 8:30 am and were escorted by our Rotaractors to the designated place. The team helped the HP representatives set up the desk and also helped them with all the other arrangements. ? The desk was ready and was open to all by 9:00 am. ? Students showed up in large numbers for the event. After the registration, the HP representatives explained them about all the latest models of HP laptops and their features. They also spoke about all the other gadgets marketed by HP. ? The HP representatives addressed all the queries, doubts and misconceptions which the students had. They also allowed the students to use the laptops and have a personal experience for a better and clear view about the gadget. ? The students were doomed to know about all the exciting offers and discounts proposed by HP. ? Before winding up, the HP representatives met with our college Principal and spoke with her for a few minutes about the successful completion and great response of the event and about all the offers and discounts that the college can avail on further purchase of any HP gadgets.",
          "year": "2019-2020"
        },
        {
          "date": "30th July 2019",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "On the occasion of World Day against Human Trafficking we, the Rotaract Club of SIES Sion East had gone to Sion Police Station to meet a police personnel who is a sub inspector over there. The event was planned well in advance and the preparations for the same had started. The PR team coordinated with the Sion Police Station through phone call well in advance. The PR was also done by the PR avenue through social media like WhatsApp and Instagram stories. Few members of our RC SIES SE met the Police sub inspector who was outspoken, supportive and very enthusiastic too.",
          "year": "2019-2020"
        },
        {
          "date": "26th July 2019",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "The project was the second version of the event which took place last year. It was planned well in advance and the permission was taken prior to the event. The publicity of the event was done on all social media handles. A desk was set up at the college foyer with novels securely placed in newspaper envelopes so that the students could not make an obvious choice. Every book in the envelope had a note in it written by the owner of that book for the one who was supposedly going to get that book in exchange. Every person participating had to bring X number of books that they want to exchange, each with a note in that written by themselves. The books that the students had brought were packed in the envelope and the students were given the same number of books they brought, along with a bookmark in it.",
          "year": "2019-2020"
        },
        {
          "date": "26th July 2019",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "On the occasion of Kargil Vijay Diwas, we, the Rotaract Club Of SIES Sion East, invited the BIA (Brothers In Arms) to come to college and give a motivational speech to the students of the college. The PR was done in the form of whatsapp messages and word of mouth. Permissions for the auditorium along with other facilities like projector, chairs and tables were taken care of well in advance. The students gathered in the auditorium of the college at 10 am. The BIA gave them a speech about the bravery and sacrifices by the Indian Army during the Kargil War. They told them inspiring stories of the Army officers and the various wars that they have fought. We gave the speakers a chocolate bar, certificates of appreciation and bouquets as a token of gratitude.",
          "year": "2019-2020"
        },
        {
          "date": "24th July 2019",
          "committee": "Womens Development Cell",
          "faculty": "Dr. Harini C.",
          "details": "Dosti house, US consulate (Your American space) organised a session on Inappropriate behaviour at workplace. Students were asked to present skits on the theme. WDC SIES CE actively participated in the event.",
          "year": "2019-2020"
        },
        {
          "date": "23rd July 2019",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "' The event was planned about 2 weeks in prior and we instantly started with the preparation. ' After contacting many professionals for the workshop, we seized the deal with the budding starz of tomorrow dance Academy. ' As soon as we received the confirmation from the trainers, we informed team Sec. The Permission for the same was taken swiftly. ' The publicity of the dance workshop commenced 3 days prior to the event. The publicity was done on all our social media handles. - The big day had arrived, we reached the venue 30 minutes before the Reporting time and did all the needful arrangements. - The registration was closed and the participants had assembled by 12pm.The trainers arrived 30 minutes late to the venue .To keep participants hyped during the wait we had them grooving to the latest hits. - The event commenced by introducing the supremely talented Steven Fernandes ,Sadik Shaikh and Alan Peter from the Starz of tomorrow dance Academy to the enthusiastic crowd. - The crew took over the dance floor and started the session by a small warm up session. - The crew taught the choreography to the evergreen song 'U-N-I( Mere Dil vich hai hum tum)' from the movie Hum Tum. The participants seem really engaged through out the session. - The trainers were helping everyone out individually to do the steps easily. The crew had selected 4 participants who were willing to dance with them and they had all performed together. - At the end of the session the crew performed their number for the entire crowd. After the president delivered his vote of thanks. The Starz of tomorrow then clicked few photos with the team and the participants. Impact Analysis of the Project? - The event turned out be helpful for the beginners as well as semi-beginners and it also challenged the dancers out there. - As it was the Debut PD event for the year its successful completion was really inspiring for the team. -It really had quite a impact on the membership as the Membership drive was still going on.",
          "year": "2019-2020"
        },

        
            {
              "date": "21st July 2019",
              "committee": "Rotract Club",
              "faculty": "Ms. Falguni Mathews",
              "details": "We were accompanied by many volunteers from all around Mumbai. ? Celebrities like Esha Gupta, Naveli Deshmukh and Kavita Kaushik had also shown their support by participating in this event. ? Everyone was energetic and enthusiastic throughout the event, we all really enjoyed a lot and felt really proud to have worked for this cause.",
              "year": "2019-2020"
            },
            {
              "date": "21st July 2019",
              "committee": "N.S.S.",
              "faculty": "Dr. Rinkesh Chheda",
              "details": "'Big Mumbai Cleanup' was organized by 'Beach Warriors' team on their 100th week cleanup celebration. The tag line of the event was `Mera Kachra Mera Zimedari' 32 NSS volunteers of our college got a great opportunity to lead 16 amongst a 100 locations.",
              "year": "2019-2020"
            },
            {
              "date": "16th July 2019",
              "committee": "N.S.S.",
              "faculty": "Dr. Rinkesh Chheda",
              "details": "To strengthen the bond between the students and professors, the N.S.S volunteers wished the professors and non-teaching staff, by offering a white flower enhancing the synergy between the shishya and the guru.",
              "year": "2019-2020"
            },
            {
              "date": "15th July 2019",
              "committee": "N.S.S.",
              "faculty": "Dr. Rinkesh Chheda",
              "details": "From 15th - 30th July, the senior N.S.S volunteers started with the enrollment process wherein through they promoted the core ideology of the NSS and what a volunteer can achieve. This allowed them to get interested students for the academic year 19-20.",
              "year": "2019-2020"
            },
            {
              "date": "1st July 2019",
              "committee": "Rotract Club",
              "faculty": "Ms. Falguni Mathews",
              "details": "The project was a district Initiative which was being carried out at various venues and we had also joined hands with the district in this step. We had collaborated with the NSS unit of our college for this project. We had received the Permission to conduct the event in our College library well in advance. The publicity was done on all social media platforms and also class to class publicity was done. Posters were put up on all classes, corridors, in the college campus and in nearby societies also. Everyone was informed about their duties and responsibilities for the smooth functioning of the event. The blood bank assigned to us was brought by Red Cross Society along with a trained team of doctors supporting the equipment.",
              "year": "2019-2020"
            },
            {
              "date": "1st July 2019",
              "committee": "N.S.S.",
              "faculty": "Dr. Rinkesh Chheda",
              "details": "The N.S.S unit and Rotaract club of our college, joined hands in organising a blood donation camp in our college, with medical experts from INDIAN RED CROSS SOCIETY. In spite of the rainy weather, 30 bags of blood were collected.",
              "year": "2019-2020"
            },
            {
              "date": "26th June 2019",
              "committee": "N.S.S.",
              "faculty": "Dr. Rinkesh Chheda",
              "details": "International Day against Drug Abuse and Illicit Trafficking is observed on 26th June to strengthen global action and co-operation to achieve the goal of an international society free of drug abuse. A group of our volunteers attended an awareness programme, hosted by University of Mumbai in collaboration with the Ministry of Home Affairs Narcotics Council Bureau at Shanmukhananda Hall.",
              "year": "2019-2020"
            },
            {
              "date": "21st June 2019",
              "committee": "N.S.S.",
              "faculty": "Dr. Rinkesh Chheda",
              "details": "We celebrated 'One Day Yoga Day'' on the occasion of the 5 th International Yoga Day, under the guidance of a well- known personality and international yoga expert 'Kush Panchal'.",
              "year": "2019-2020"
            },
            {
              "date": "16th June 2019",
              "committee": "Rotract Club",
              "faculty": "Ms. Falguni Mathews",
              "details": "It started when the community service directors went to the BMC office to check if they could help them in anyway. They were informed about the pulse polio campaigns being held at different locations of Sion for the kids whose parents couldn't afford such vaccine/treatment. We, Rotaractors joined hands with them to assist in their work and make their reach farther. A day prior to the camp, a training session on how to give the drops and mark a child after completion of the procedure, were given to each Rotaractor. Each Rotaractor witnessed and performed the task handed over to them. We collaborated to assist in a small way eradicating polio from the areas in our college vicinity. Whatsapp had been a powerful source for us to encourage Rotaractors in taking this tiny step to eradicate polio.",
              "year": "2019-2020"
            },
            {
              "date": "12th June 2019",
              "committee": "Rotract Club",
              "faculty": "Ms. Falguni Mathews",
              "details": "The event was a district initiative carried out on a large scale for everyone at free of cost and we decided to join hands with them in this selfless step. We followed the standard procedure for registering ourselves. According to the team's convenience, we chose 4 locations out of the set of locations handed over to us. We had a total strength of 12 people; 3 people were assigned at each location. The event was publicised on all our club social media platforms i.e. Instagram and Facebook and at individual level through WhatsApp.",
              "year": "2019-2020"
            },
            {
              "date": "31st May 2019",
              "committee": "N.S.S.",
              "faculty": "Dr. Rinkesh Chheda",
              "details": "From 31st May - 13th June, 2019, the N.S.S Volunteers assisted the college in the admission process. They were active in different avenues like Admin desk, IT Dept etc. The enrollment processes gave them a sense of satisfaction and also enriched their various technical, tackle skills.",
              "year": "2019-2020"
            },
            {
              "date": "30th March 2019",
              "committee": "N.S.S.",
              "faculty": "Dr. Rinkesh Chheda",
              "details": "`Know The Tree' was an initiative by Greenline Mumbai in collaboration with tree specialist Ms Renu Vyas . The NSS volunteers got an opportunity to participate in this event which was held at Five Gardens at Wadala .",
              "year": "2019-2020"
            },
            {
              "date": "10th March 2019",
              "committee": "Rotract Club",
              "faculty": "Ms. Falguni Mathews",
              "details": "To help members decide which avenue suits their interest in the club. To assist them in understanding what members want from the club. To get members out of their comfort zone and let them experiment in fields they aren't very used to. To let members, know their importance in the club and that they hold an integral part of the club, and the significance of them choosing the correct avenue personally and for the club.",
              "year": "2019-2020"
            },

            
                {
                  "date": "3rd March 2019",
                  "committee": "N.S.S.",
                  "faculty": "Dr. Rinkesh Chheda",
                  "details": "The N.S.S students, assisted by Sion Transit camp, organised a Polio Vaccination camp at Rawali camp. A day before the camp, a seminar was held so as to familiarise the volunteers with their roles and responsibilities and they duly did their allotted duties, with great success.",
                  "year": "2019-2020"
                },
                {
                  "date": "23rd November 2018",
                  "committee": "Environmental Studies",
                  "faculty": "Mrs. Priti Thakkar",
                  "details": "SEMINAR ON INNOVATIONS IN SUSTAINABILITY",
                  "year": "2019-2020"
                },
                {
                  "date": "23rd November 2018",
                  "committee": "Iqac",
                  "faculty": "Ms. Sangeeta Kore",
                  "details": "National level Seminar for students on ' Innovations in Sustainability'",
                  "year": "2019-2020"
                },
                {
                  "date": "8th December 2019",
                  "committee": "N.S.S.",
                  "faculty": "Dr. Swati Iyer",
                  "details": "Celebrated Independence Day With Singing Patriotic Songs Speeches On Freedom Fighter And University And Nss Song Followed By Aerobics Session",
                  "year": "2018-2019"
                },
                {
                  "date": "29th September 2019",
                  "committee": "Placement Committee",
                  "faculty": "Ms. Raina Banu Baji",
                  "details": "Viva College, Virar conducted Wipro Placement Drive and 4 students got selected.",
                  "year": "2018-2019"
                },
                {
                  "date": "31st March 2019",
                  "committee": "Internship Cell",
                  "faculty": "Mrs. Fleur Fernandes",
                  "details": "187 students were selected for internships in 2018-19. 71 students received internship through colleges Internship Cell and 37 students were picked via colleges tie-up with Internshala. 79 students received internships through their own contacts.",
                  "year": "2018-2019"
                },
                {
                  "date": "27th February 2019",
                  "committee": "Marathi Vangmay Mandal",
                  "faculty": "Ms. Ruta Prabhu",
                  "details": "MARATHI BHASHA DIWAS is celebrated on 27 th February 2019 to pay tribute to the Marathi poet Vishnu Vaman Shirwadkar (Kusumagraj) on his birth anniversary.",
                  "year": "2018-2019"
                },
                {
                  "date": "18th February 2019",
                  "committee": "Iqac",
                  "faculty": "Ms. Sangeeta Kore",
                  "details": "National Seminar on - 'Diversity and Inclusion -A road map for 21st century'",
                  "year": "2018-2019"
                },
                {
                  "date": "16th February 2019",
                  "committee": "Womens Development Cell",
                  "faculty": "Dr. Harini C.",
                  "details": "As a part of the womens empowerment week, a brownie baking workshop was conducted for faculty and students. The resource person was Ms. Vaishali Shah.",
                  "year": "2018-2019"
                },
                {
                  "date": "15th February 2019",
                  "committee": "Womens Development Cell",
                  "faculty": "Dr. Harini C.",
                  "details": "As a part of womens empowerment week, WDC organised a jewellery making workshop for students and faculty. The workshop was led by Ms. Yashwini Gawande",
                  "year": "2018-2019"
                },
                {
                  "date": "14th February 2019",
                  "committee": "Womens Development Cell",
                  "faculty": "Dr. Harini C.",
                  "details": "As a part women empowerment week observed by SIESCE WDC a Zumba workshop was organised for students and faculty members.",
                  "year": "2018-2019"
                },
                {
                  "date": "6th February 2019",
                  "committee": "Rotract Club",
                  "faculty": "Ms. Falguni Mathews",
                  "details": "Rotaract associated with college",
                  "year": "2018-2019"
                },
                {
                  "date": "4th February 2019",
                  "committee": "Womens Development Cell",
                  "faculty": "Dr. Harini C.",
                  "details": "Yuvak Yuvati mela was organised by SIESCE WDC in collaboration with Maharashtra state womens commission and Akshara foundation on 4th Feb 2019 in the college premises",
                  "year": "2018-2019"
                },
                {
                  "date": "1st February 2019",
                  "committee": "Economics",
                  "faculty": "Dr. Harini C.",
                  "details": "WDC organised a 10 day self defense training for students from 1st Feb to 15th Feb.",
                  "year": "2018-2019"
                },
                {
                  "date": "25th January 2019",
                  "committee": "Research Cell",
                  "faculty": "Dr. Seethalekshmy. Narayana Iyer",
                  "details": "The workshop was on various concepts of IPR and how to register IPR and importance of IPR. it was well attended by undergraduates FY , Sy and TY B.Com students.",
                  "year": "2018-2019"
                },
                {
                  "date": "25th January 2019",
                  "committee": "Rotract Club",
                  "faculty": "Ms. Falguni Mathews",
                  "details": "Main idea behind the event: exploring the nature's beauty, creating relations amongst people, generating little employment near visapur village.",
                  "year": "2018-2019"
                },
                {
                  "date": "23rd January 2019",
                  "committee": "Womens Development Cell",
                  "faculty": "Dr. Harini C.",
                  "details": "In collaboration with Rescue trust SIES WDC has organised a talk on womens safety in the cyber world.",
                  "year": "2018-2019"
                },
                {
                  "date": "10th January 2019",
                  "committee": "N.S.S.",
                  "faculty": "Dr. Swati Iyer",
                  "details": "The NSS Residential Camp was successfully conducted this year with a participation of 42 students at Shivansai , Panvel from the 4th January,2019 to 10th January , 2019. A significant contribution was made to the village during these seven days",
                  "year": "2018-2019"
                },
                {
                  "date": "5th January 2019",
                  "committee": "Placement Committee",
                  "faculty": "Ms. Raina Banu Baji",
                  "details": "Viva College, Virar conducted Infosys Placement Drive and 2 students got selected.",
                  "year": "2018-2019"
                }      
      
  ]