[
    {
      "date": "25th July 2020",
      "committee": "N.S.S.",
      "faculty": "Dr. Rinkesh Chheda",
      "details": "On 25th July, 2020 our guest speaker Ms. Jannet helped students understand more about Hepatitis B & C. An awareness video was shared across NSS social media.",
      "year": "2020-2021"
    },
    {
      "date": "15th July 2020",
      "committee": "N.S.S.",
      "faculty": "Dr. Rinkesh Chheda",
      "details": "Online session on hearing impairment. Guest speakers Aakash Sir and Prajakta Ma'am created awareness about hearing impairment and 21 disabilities.",
      "year": "2020-2021"
    },
    {
      "date": "1st July 2020",
      "committee": "N.S.S.",
      "faculty": "Dr. Rinkesh Chheda",
      "details": "Street play recreated through 'home play' method to maintain COVID-19 precautions while spreading awareness.",
      "year": "2020-2021"
    },
    {
      "date": "26th June 2020",
      "committee": "N.S.S.",
      "faculty": "Dr. Rinkesh Chheda",
      "details": "Online session on road safety stressing the importance of helmets, traffic rules, and pedestrian safety.",
      "year": "2020-2021"
    },
    {
      "date": "20th June 2020",
      "committee": "N.S.S.",
      "faculty": "Dr. Rinkesh Chheda",
      "details": "Online Yoga Session conducted under the guidance of Sir Kush Panchal. Covered yoga poses and importance.",
      "year": "2020-2021"
    },
    {
      "date": "13th June 2020",
      "committee": "N.S.S.",
      "faculty": "Dr. Rinkesh Chheda",
      "details": "Slogan writing and essay competition (held on 28th April 2020) on COVID-19 awareness and life before/after pandemic.",
      "year": "2020-2021"
    },
    {
      "date": "5th June 2020",
      "committee": "N.S.S.",
      "faculty": "Dr. Rinkesh Chheda",
      "details": "World Environment Day celebrated to raise awareness about climate action and sustainability. Organized by Dept. of Basic Sciences and Humanities.",
      "year": "2020-2021"
    },
    {
      "date": "28th April 2020",
      "committee": "N.S.S.",
      "faculty": "Dr. Rinkesh Chheda",
      "details": "Slogan writing competition on COVID-19 precautions and essays on ‘Life before and after Corona’.",
      "year": "2020-2021"
    },
    {
      "date": "27th April 2020",
      "committee": "N.S.S.",
      "faculty": "Dr. Rinkesh Chheda",
      "details": "Poster-making event conducted online on COVID-19 awareness with participation from NSS and other students.",
      "year": "2020-2021"
    },
    {
      "date": "16th January 2020",
      "committee": "N.S.S.",
      "faculty": "Dr. Rinkesh Chheda",
      "details": "Online poster-making competition conducted on the occasion of a blood donation drive held in college.",
      "year": "2020-2021"
    },
    {
      "date": "28th May 2020",
      "committee": "Womens Development Cell",
      "faculty": "Mr. Vinayak Krishnan",
      "details": "Online quiz competition 'Naari 2020' with 1322 participants to spread awareness on women's issues.",
      "year": "2019-2020"
    },
    {
      "date": "18th May 2020",
      "committee": "Womens Development Cell",
      "faculty": "Dr. Harini C.",
      "details": "3-day online dance workshop for girl students conducted by WDC in collaboration with SIESMIC. Trainer: Ms. Anjali Nair.",
      "year": "2019-2020"
    },
    {
      "date": "1st May 2020",
      "committee": "Students Counselling Committee",
      "faculty": "Dr. Harini C.",
      "details": "Webinar on 'Mental Health in the Time of Corona' for students, on World Health and Safety Day. Speaker: Ms. Nishiganda Sawant.",
      "year": "2019-2020"
    },
    {
      "date": "30th April 2020",
      "committee": "Students Counselling Committee",
      "faculty": "Dr. Harini C.",
      "details": "Webinar for teachers on 'Mental Health in the Time of Corona', observing World Health & Safety Day. Speaker: Ms. Nishiganda Sawant.",
      "year": "2019-2020"
    },
    {
      "date": "26th February 2020",
      "committee": "Womens Development Cell",
      "faculty": "Mr. Vinayak Krishnan",
      "details": "Women’s Empowerment Day celebrated with Zumba by Ms. Aathira Pradeep and Punchcraft by Ms. Aashna Gupta. Attended by UG and PG students.",
      "year": "2019-2020"
    },
    {
      "date": "28th January 2020",
      "committee": "Economics",
      "faculty": "Ms. Alisha Varghese",
      "details": "Know Your Economy Test conducted with Scientific Research Association. 187 students registered, 163 appeared. Cash prizes awarded.",
      "year": "2019-2020"
    },
    
        {
          "date": "28th January 2020",
          "committee": "Internship Cell",
          "faculty": "Mrs. Fleur Fernandes",
          "details": "Students desiring to do internships were instructed to download the form, fill it and submit it to Mrs. Fleur Fernandes along with a registration fee of Rs. 100.",
          "year": "2019-2020"
        },
        {
          "date": "25th January 2020",
          "committee": "Speakers Forum",
          "faculty": "Ms. Manasi Shah",
          "details": "Annual event SIES Inter-Collegiate Debate organized by the Speakers Forum. Report attached.",
          "year": "2019-2020"
        },
        {
          "date": "24th January 2020",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "Seminar conducted for faculty members. Speaker: Ms. Marissa Borges from Red Dot Foundation on POSH and POSCO. 52 teachers attended.",
          "year": "2019-2020"
        },
        {
          "date": "24th January 2020",
          "committee": "Marathi Vangmay Mandal",
          "faculty": "Ms. Ruta Prabhu",
          "details": "Inter-collegiate festival Kalavisar organized to promote Marathi culture. 8 colleges participated.",
          "year": "2019-2020"
        },
        {
          "date": "22nd January 2020",
          "committee": "Placement Committee",
          "faculty": "Ms. Ruta Prabhu",
          "details": "Capgemini Placement Drive conducted by Ramniranjan Jhunjhunwala College. 1 student was selected.",
          "year": "2019-2020"
        },
        {
          "date": "18th January 2020",
          "committee": "Research Cell",
          "faculty": "Dr. Seethalekshmy. Narayana Iyer",
          "details": "Intercollegiate research PPT competition organized. 10 teams participated. Judges: Dr. Usha Bhandare, Ms. Shikha Pandey, Dr. Swati Suryanarayanan.",
          "year": "2019-2020"
        },
        {
          "date": "10th January 2020",
          "committee": "Library Committee",
          "faculty": "Dr. Seethalekshmy. Narayana Iyer",
          "details": "Book review competition held with 15 student participants. Judges were Dr. Lakshmi and Mrs. Leekha Nambiar.",
          "year": "2019-2020"
        },
        
            {
              "date": "9th January 2020",
              "committee": "Placement Committee",
              "faculty": "Ms. Ruta Prabhu",
              "details": "Vidyalankar Institute of Technology conducted Infosys Placement drive and 4 students were selected.",
              "year": "2019-2020"
            },
            {
              "date": "24th December 2019",
              "committee": "Rotract Club",
              "faculty": "Ms. Falguni Mathews",
              "details": "The project was an all over Mumbai tournament for carrom and chess organized by the sports avenue. The project was carried out for all the players of carrom and chess to enhance their skills and showcase them by competing against other players. The planning for the event commenced in the beginning of the December and we searched to find the logistics required to conduct the event along with the venue. We approached our principal to help us get permissions for SIES school hall, Matunga as it would be an apt stage and remove the incumbrance of travelling. All the logistics were arranged on personal basis and free of cost so that maximum prizes could be awarded to the winners. On the day, the team arrived an hour before the scheduled time to setup the logistics so the event could be commenced on time. Registration desks were setup and a nominal fee to be a part of the tournament was charged, the event started at 9:15 am and concluded at 4 pm. The event was publicized on all social media handles of the club to reach as many people as possible. Even though a sense of competing was created it was all in good spirit and was filled with feelings of enjoyment for the participants as well as the team. Participants were awarded with appreciation and participation certificates.",
              "year": "2019-2020"
            },
            {
              "date": "19th December 2019",
              "committee": "Iqac",
              "faculty": "Ms. Sangeeta Kore",
              "details": "Workshop for non teaching Staff on Digital Transformation ' Paperless Office Administration'",
              "year": "2019-2020"
            },
            {
              "date": "10th December 2019",
              "committee": "Rotract Club",
              "faculty": "Ms. Falguni Mathews",
              "details": "The idea of the event rooted from one of the avenue meets which took place, the members came up with this idea of visiting government offices and questioning them about the triggering issue faced by us today. We decided to conduct this event on world Anti-corruption day. We had prepared a list of questions which we might ask the officers. We also decided the government offices which we might visit. The publicity of the event was done on all our social media platforms. On day around 15 members had shown up for the event. We met in college first, from where we left together. we the Rotaract Club of SIES Sion East visited various Government offices in the neighbouring areas of Sion, Matunga and Wadala. We spent almost 7 hours covering all the offices. Firstly, we went to the Sion Police station wherein we had a small interview with the senior inspector and penned down his views on how corruption can have a serious impact on our society. The interview went out pretty well. The officer seemed to be very practical and had strong opinions towards the issue. Next, we went to the BMC office in Matunga and interviewed one of the senior officers which went out pretty well too. As he was one of the senior officers he had a lot of insight on the issue and he conveyed that it is small and general ignorant issues which had led this problem to grow bigger day by day thereby making it destructive for the economy. He also said that to eradicate this issue everyone has to join their hands and pledge towards being a better citizen. Finally, we headed to the RTO office in Wadala. There we took an interview of an officer belonging to a superior position. He gave us his valuable thoughts about anti-corruption, it's root cause, ways by which we can reduce it and also spoke about many unknown facts which astonished all of us. We felt honoured to have a good conversation with such valuable people of our society whose aim is to eliminate the menace of corruption. Though we had a questionnaire prepared majority of the questions where impromptu, it was less like an interview and more like an interactive session.",
              "year": "2019-2020"
            },
            {
              "date": "9th December 2019",
              "committee": "Rotract Club",
              "faculty": "Ms. Falguni Mathews",
              "details": "This project is an initiative of Mr. Ramesh Jain who himself is an entrepreneur for the past 30 years. Through this project 'UDAAN' Mr. Ramesh Jain & his team of entrepreneurs wants to give a platform to students, housewives, young generation and unemployed people to develop the entrepreneurial qualities and skills to start their own business. We informed the secretary about the requirements for the event which were taken care off. The publicity of the event was done all our social media platforms. On day the team had arrived 30 minutes prior to the event and took care of all the preparations. Mr. Ramesh sr and his team had arrived at the venue on time. All the arrangements were done and the event had commenced. Mr.Ramesh sr had conducted the seminar in a practical and interactive manner , he spoke to everyone friendly and answered their various doubts and queries. He cleared all the misconceptions everyone possessed with astonishing facts and proofs thereby giving them the confidence they needed. The audience got to acquire a lot of knowledge from this seminar.it turned out to be very fruitful for them.",
              "year": "2019-2020"
            },
            {
              "date": "7th December 2019",
              "committee": "Iqac",
              "faculty": "Ms. Sangeeta Kore",
              "details": "workshop for teachers on Digital Transformation & Autonomy",
              "year": "2019-2020"
            },

            
                {
                  "date": "30th November 2019",
                  "committee": "Research Cell",
                  "faculty": "Dr. Seethalekshmy. Narayana Iyer",
                  "details": "Dr. Peter Cunningham from Nelson Mandela University, South Africa has conducted a workshop in 30th Nov 2019 from 10 am to 12 noon.",
                  "year": "2019-2020"
                },
                {
                  "date": "30th November 2019",
                  "committee": "Rotract Club",
                  "faculty": "Ms. Falguni Mathews",
                  "details": "The government took a huge step towards spreading awareness about Road safety by organizing Mahawalkathon- marching for the safety of ours and our loved ones by spreading awareness about rode safety and why is it important to acknowledge the issue. We were informed about this initiative from our coordinators who insisted in joining hands towards this strong initiative. We then informed our members about this initiative they seemed to be very excited and wanted to volunteer for this event. We then sent a letter addressing to the Government of Maharashtra(MMVD & PWD) stating our presence at the Mahawalkathon and the list of the rotaractors who will be volunteering.",
                  "year": "2019-2020"
                },
                {
                  "date": "29th November 2019",
                  "committee": "Iqac",
                  "faculty": "Ms. Sangeeta Kore",
                  "details": "Session for teachers on Internationalization of Higher Education",
                  "year": "2019-2020"
                },
                {
                  "date": "23rd November 2019",
                  "committee": "Environmental Studies",
                  "faculty": "Mrs. Priti Thakkar",
                  "details": "NATIONAL SEMINAR ON INNOVATIONS IN SUSTAINABILITY ORGANISED BY IQAC, DEPARTMENT OF ENVIRONMENTAL STUDIES AND BMS",
                  "year": "2019-2020"
                },
                {
                  "date": "15th November 2019",
                  "committee": "Rotract Club",
                  "faculty": "Ms. Falguni Mathews",
                  "details": "Break The Barrier 2.0 is one of the mega project of Professional Development Avenue. It is a self defence workshop for all the young girls. The event took place last year in SIES High school and it turned out to be a huge success. So we decided to conduct the event this year too. We contacted the same trainer who had trained last year to be a part of this event. He agreed to be a trainer of the self defence workshop.",
                  "year": "2019-2020"
                },
                {
                  "date": "10th November 2019",
                  "committee": "Placement Committee",
                  "faculty": "Ms. Ruta Prabhu",
                  "details": "TCS conducted an online aptitude test for placement and 3 students got selected.",
                  "year": "2019-2020"
                },
                {
                  "date": "25th October 2019",
                  "committee": "Rotract Club",
                  "faculty": "Ms. Falguni Mathews",
                  "details": "The event was planned about a month ago. We scheduled the event right after the exams as it would act as a stress buster for the members. We contacted many pet caf's. We explained about the event to everyone and spoke to them about the rates, amenities and also about the various breeds of dogs possessed by them. After looking in to each and everything, we then decided to collaborate with 'pawfect caf' in Andheri. The rates charged were per person 200 rs for 1 hour. They had Labrador, golden retriever, Pug, Shih Tzu, Beagle, Siberian Husky, Rottweiler, American Bully and Boxer. The publicity of the event was done on all our social media platforms. All the other arrangements were taken care off. We had informed the manager about the no of people who might show up for the event. As only certain no of people are allowed at a particular time. On day everyone had assembled at the venue by 11:30. The manager had explained to everyone the do's and don'ts . After which everyone was allowed to play. The members were divided in to 2 group of 15 each. All the dogs were just too adorable and charming, they were very cheerful and welcoming too. They got along with each and everyone of us and treated us with love and care. Not sure if were able to reciprocate the same amount of love and care we received, but everyone did leave a piece of their heart in the magical beings with 4 paws forever. No one was willing to leave, everyone were just glued to the dogs and were not letting them go. It was indeed a much needed therapy session for them which got them out of their zones and be hooman for a while.",
                  "year": "2019-2020"
                },
                {
                  "date": "19th October 2019",
                  "committee": "Speakers Forum",
                  "faculty": "Ms. Manasi Shah",
                  "details": "-SIES International Model United Nations Conference is an event organised by the Speakers Forum that is based on the concept of the committee deliberations and meetings of the United Nations Conference. For the year 2019-20, four committees with their individual agendas were chosen for the conference. 1. All India Political Parties Meet : Agenda: i. Balancing Security Issues of the state and Rights of the Individuals with Special Emphasis on UAPA Ammendment Bill. ii. Reviewing Existing Environmental Laws and its Efficiency in Light of Mass Development Schemes. 2. UN Human Rights Council : Agenda: i) Human Rights Situation In Syrian Arab Republic. 3) UN Security Council : Agenda: i)Establishment of Nuclear Weapons Free Zone in the Middle East 4) International Press. Agenda: Reporting Detailed report attached.",
                  "year": "2019-2020"
                },
                {
                  "date": "12th October 2019",
                  "committee": "Womens Development Cell",
                  "faculty": "Dr. Harini C.",
                  "details": "WDC organised an intra collegiate event for students NEXT GEN-DER. The various events were essay writing and poster making. Winners were felicitated by in a separate meeting conducted later on",
                  "year": "2019-2020"
                },
                {
                  "date": "5th October 2019",
                  "committee": "Rotract Club",
                  "faculty": "Ms. Falguni Mathews",
                  "details": "This event was conducted by us last year, as it was a big success we decided to carry on with it this year too. We started planning for this event well in advance. Several formal invites were sent to for being the trainer for this event. Within a few days we received a confirmation from her for this event. we contacted the Gift NGO in Malad and spoke to them about the entire plan. They agreed to collaborate with us for this event. We then scheduled the time, period and date according to the convenience of the trainer and the GIFT ngo.",
                  "year": "2019-2020"
                },
                {
                  "date": "19th September 2019",
                  "committee": "Internship Cell",
                  "faculty": "Mrs. Fleur Fernandes",
                  "details": "Mrs. Fleur Fernandes, the Chairperson of Internship Cell of the college conducted the seminar from 10 a.m. to 12 noon. The topics covered during the session were layout of the CV, common errors made, using impactful language, preparation for internship interview questions and soft skills for interview.",
                  "year": "2019-2020"
                },

                
                    {
                      "date": "19th September 2019",
                      "committee": "N.S.S.",
                      "faculty": "Dr. Rinkesh Chheda",
                      "details": "Under the directives of 'SWACCHATA PAKHWARA', the NSS unit adopted Sion station as part of a 'Cleanup Drive'. They also performed a skit-com-dance to spread awareness using the theme 'LOVE YOU ZINDAGI'",
                      "year": "2019-2020"
                    },
                    {
                      "date": "18th September 2019",
                      "committee": "Speakers Forum",
                      "faculty": "Ms. Manasi Shah",
                      "details": "An Elocution event organised by the Speakers Forum on behalf of the Forum of Free enterprise. The selected student competes at an inter-collegiate level competition organised by the Forum of Free Enterprise. The top 3 winners from the college get cash prizes. Report attached.",
                      "year": "2019-2020"
                    },
                    {
                      "date": "16th September 2019",
                      "committee": "N.S.S.",
                      "faculty": "Dr. Rinkesh Chheda",
                      "details": "In keeping with the university guidelines for the month of September, the idea of nutrition in mind, the students attended a session on Balanced Diet - Physical and Mental where stress was laid on the practice of keeping a healthy body and mind, both through food and physical activities.",
                      "year": "2019-2020"
                    },
                    {
                      "date": "15th September 2019",
                      "committee": "Rotract Club",
                      "faculty": "Ms. Falguni Mathews",
                      "details": "ROTARACT ACADEMYS Digital Marketing Workshop Conducted by Talestroke The speaker for the session is Mr.Pankaj. The business head of tale stroke holding 5 years experience in FMCG sales and education field. He has trained sales freshers to pitch presentation and now helps young professionals to build career in digital marketing course.",
                      "year": "2019-2020"
                    },
                    {
                      "date": "23rd August 2019",
                      "committee": "Rotract Club",
                      "faculty": "Ms. Falguni Mathews",
                      "details": "The event was planned well in advance. The confirmation was taken from the instructors almost 2 weeks prior to the event. All permissions from the college authorities were also taken beforehand. The enlightening topic for the seminar was 'Data science and Analytics'. The spectators were eager and curious regarding the seminar as though how will it benefit a commerce graduate, what is to be done to be a data scientist etc. were few questions arising in the minds of the viewers. 4 guests had been present to take this Seminar out of which 3 were IIT / IIM graduates and who flawlessly conducted the whole seminar. All doubts and questions raised by the audience were answered by the speakers calmly and in a way to make them understand most about this unexplored profession which is open to all streams. An overwhelming crowd of more than 40 were there to attend the whole seminar. The feedback from the audience was amazing. A lot of students were interested to know more about this particular data science field. All myths of the viewers were clarified by the instructors with examples and practical scenarios which gave the viewers an easy grasp of the topics covered in the session. In the end, the speakers distributed a free counselling session flyer for the interested audience which was very beneficial for them.",
                      "year": "2019-2020"
                    },
                    {
                      "date": "23rd August 2019",
                      "committee": "N.S.S.",
                      "faculty": "Dr. Rinkesh Chheda",
                      "details": "On the eve of 150 Gandhi's birthday, the University of Mumbai made an initiative to structure his entire way of struggle thoughts idea in the book Gandhi@150 which was written by various well known writers. The N.S.S volunteers were part of the inauguration ceremony.",
                      "year": "2019-2020"
                    },
                    {
                      "date": "21st August 2019",
                      "committee": "Internship Cell",
                      "faculty": "Mrs. Fleur Fernandes",
                      "details": "A workshop on Google Analytics was organised by Internship Cell and conducted by trainers from MBA Pathshala. Students were divided into three batches. Accordingly, sessions of 3 hours each were conducted on 19, 20 and 21 August 2019. Students gave excellent reviews for the session.",
                      "year": "2019-2020"
                    },
                    {
                      "date": "20th August 2019",
                      "committee": "Rotract Club",
                      "faculty": "Ms. Falguni Mathews",
                      "details": "The date for the installation ceremony was booked by us in the month of march. Out of our 3 preferable options, we were assigned 16th August,2019 from 6 pm to 8 pm for conducting the installation ceremony. But due to some uncertainties the event was later postponed to 20th August,2019 from 5 pm to 7 pm. The permission to conduct the event in SIES high school hall was taken in advance. The preparations were started about 2 weeks prior to the event. Auditions were held to choose the host for the installation ceremony, in which many members had participated out of which Rtr.Fiza and Rtr.Krithika were chosen. The rest of them were assigned in various avenues such as Admin, Creatives ,Digitals, Order & Discipline and Back stage. The auditions were taken by our former hosts and Vice-Presidents 2019-2020 Rtr.Deep Chandra and Rtr.Tanya Bhambri. The finance was handled by Rtr.Pranav Ramesh and Rtr.Sagar Shetty, our treasurers. The script for the installation ceremony was prepared by Rtr.Priyanka Mudaliyar, Editorials head. Everyone was well verse with their duties and responsibilities. The team was very much prepared and ready to face the big-day. The D-day had arrived, everyone had assembled at the venue by 4 pm to get started with all the preparations. All the dignitaries had reached the venue before 5 pm. The event was delayed by 30 minutes due to some technical issues but we managed to end it on time.",
                      "year": "2019-2020"
                    },
                    {
                      "date": "19th August 2019",
                      "committee": "N.S.S.",
                      "faculty": "Dr. Rinkesh Chheda",
                      "details": "The N.S.S unit attended a seminar, Bottles for change, hosted by Bisleri company. The session highlighted the fact that human attitude & usage was more dangerous and introduced a new 'bottles for change application'",
                      "year": "2019-2020"
                    },
                    {
                      "date": "18th August 2019",
                      "committee": "N.S.S.",
                      "faculty": "Dr. Rinkesh Chheda",
                      "details": "On 18th August 2019, a group of 45 N.S.S volunteers actively participated in cleaning up the area in and around Sion fort. They were assisted by Sangam Pratishthan, an NGO working on the idea of waste segregation.",
                      "year": "2019-2020"
                    }
                  
              
          
  ]