[
    {
      "date": "9th December 2018",
      "committee": "Placement Committee",
      "faculty": "Ms. Raina Banu Baji",
      "details": "KPB Hinduja College, Girgoan conducted Deloitte Placement Drive and 2 students got selected.",
      "year": "2018-2019"
    },
    {
      "date": "30th November 2018",
      "committee": "Placement Cell",
      "faculty": "Dr. Harini C.",
      "details": "Placement cell has organised a session on career guidance for TYBCom students titled Carving the path to success on 30th Nov 2018. Career consultant Ms. Bhuvaneswari Raman was the speaker. Speaker discussed various career options that students can pursue after graduation.",
      "year": "2018-2019"
    },
    {
      "date": "29th November 2018",
      "committee": "Womens Development Cell",
      "faculty": "Dr. Harini C.",
      "details": "An awareness session on PCOS was organised for girl students by WDC on 29th Nov 2018. Speaker was `Dr. Jyothi Kulkarni, a gynecologist.",
      "year": "2018-2019"
    },
    {
      "date": "24th November 2018",
      "committee": "Rotract Club",
      "faculty": "Ms. Falguni Mathews",
      "details": "The project involved educating underprivileged women and children about menstrual cycle and hygiene related to it. It also focused on breaking the myths related to menstruation. The speaker was Miss. Priya Tiwari. She was there from an NGO 'Safe City'.",
      "year": "2018-2019"
    },
    {
      "date": "22nd November 2018",
      "committee": "Rotract Club",
      "faculty": "Ms. Falguni Mathews",
      "details": "Yellow Fellow was an event to break a world record wearing yellow socks puppets showing rights for children. Event was organized by CRY (child rights and you). It was an attempt to break a world record and to note into genius books of world record.",
      "year": "2018-2019"
    },
    {
      "date": "18th November 2018",
      "committee": "Rotract Club",
      "faculty": "Ms. Falguni Mathews",
      "details": "? Some RID 3141 club decided to do clothes Donation on specific same day at different possible area. ? So, We planned clothes donation drive near the Tata memorial hospital where people where living on footpath",
      "year": "2018-2019"
    },
    {
      "date": "14th November 2018",
      "committee": "Rotract Club",
      "faculty": "Ms. Falguni Mathews",
      "details": "? On the occasion of World diabetes day, lions club international district 323, organized a rally from five gardens, matunga to khalsa college ground, with a huge crowd of 1500 and more people. ? The reporting time for the rally was 7:30am at 5 gardens.",
      "year": "2018-2019"
    },
    {
      "date": "4th November 2018",
      "committee": "Rotract Club",
      "faculty": "Ms. Falguni Mathews",
      "details": "'Reliving The Era' was an official ceremony for inducting the core team and board of directors of 2018-2019. The occasion was embraced by some special dignitaries namely., Dr. Nina Roy Choudhury (SIES College Principal), Rotary President Rtn. K.B.R Swamy and DRR Elect 18-19 Rtr. Kushal Buwa just to name a few.",
      "year": "2018-2019"
    },
    {
      "date": "12th October 2018",
      "committee": "Rotract Club",
      "faculty": "Ms. Falguni Mathews",
      "details": "Educate girls on self defence",
      "year": "2018-2019"
    },
    {
      "date": "10th October 2018",
      "committee": "Rotract Club",
      "faculty": "Ms. Falguni Mathews",
      "details": "Since 1988, the 11th of October every years is celebrated as World Coming Out Day. The initial idea to celebrate this day was to lay emphasis on the basic form of activism, i.e. coming out to friends, family and colleagues and living kife as an openly gay or lesbian person. With the Supreme Court, legalizing homosexuality in India this year, it was important to create awareness regarding the pressure one goes through while coming out. In order to achieve this a silent skit was performed in the quadrangle of the college, involving 6 members as performers.",
      "year": "2018-2019"
    },
    {
      "date": "10th October 2018",
      "committee": "Rotract Club",
      "faculty": "Ms. Falguni Mathews",
      "details": "The event 'Festive Inshorts' was organized to let the club members, writers and non- writers take some time off and think about what festivals mean to them. Since the month of October is essential with tons of festivals, It comes along with the joy and the excitement of celebrating these festivities in a combination of traditional and modern ways.",
      "year": "2018-2019"
    },
    {
      "date": "8th October 2018",
      "committee": "Rotract Club",
      "faculty": "Ms. Falguni Mathews",
      "details": "The project was conducted in a way by teaching the students various steps of garba. We had 3 garba teachers to come and teach various garba steps to the students. There was a lot of excitement for the upcoming navratri festival, thus the enthusiasm to learn garba was a lot among everyone.",
      "year": "2018-2019"
    },
    {
      "date": "4th October 2018",
      "committee": "Library",
      "faculty": "Mrs. Anuprita Sardesai",
      "details": "Hands-on Training on J-Gate online databases for Third year and Postgraduate Students",
      "year": "2018-2019"
    },
    
        {
          "date": "29th September 2018",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "As Indian railways took an initiative of cleaning railway stations across India on account of 150th birthday of Mahatma Gandhi - Father of nation. To help them out and volunteer our time for Swachhta Abhiyaan, we planned to clean and create cleanliness awareness at Dadar station. We spoke to Dadar Central Railway Station director Savan sir to organize the cleanliness drive, and they were glad that we had taken the initiative to do so and gave a positive response for the project.",
          "year": "2018-2019"
        },
        {
          "date": "27th September 2018",
          "committee": "IQAC",
          "faculty": "Ms. Sangeeta Kore",
          "details": "Workshop for non-teaching staff on Health Management - Ergonomic Interactive Session.",
          "year": "2018-2019"
        },
        {
          "date": "27th September 2018",
          "committee": "Commerce Forum",
          "faculty": "Mr. Abhijeit Bhosale",
          "details": "As part of its extra-curricular activities, SIES-C&E organised its annual career guidance festival, 'DISHA - The Edu-tainment Fiesta.' Disha aimed to enrich the youth by educating them about myriad career opportunities through seminars, workshops, and competitions. The event was held on 27-28th September 2018, with inauguration and internship fair on 26th September.",
          "year": "2018-2019"
        },
        {
          "date": "22nd September 2018",
          "committee": "Students Counselling Committee",
          "faculty": "Dr. Harini C.",
          "details": "An intra collegiate competition titled Antarman was organised by the counselling committee. Students enthusiastically participated in various events.",
          "year": "2018-2019"
        },
        {
          "date": "21st September 2018",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "This year, we celebrated differently by focusing on peace within our country. We sought people’s opinions on peace in India, promoting unity among diverse faiths and religions.",
          "year": "2018-2019"
        },
        {
          "date": "21st September 2018",
          "committee": "Women's Development Cell",
          "faculty": "Dr. Harini C.",
          "details": "WDC in collaboration with NGO Majlis organised an intra collegiate competition on the theme My Body - My Choice. Students from various courses participated in different events.",
          "year": "2018-2019"
        },
        {
          "date": "19th September 2018",
          "committee": "IQAC",
          "faculty": "Ms. Sangeeta Kore",
          "details": "Workshop for non-teaching staff on Essentials of Dealing with Situations.",
          "year": "2018-2019"
        },
        {
          "date": "13th September 2018",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "Donation drive.",
          "year": "2018-2019"
        },
        {
          "date": "13th September 2018",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "Bappagraphy was an initiative where participants captured Ganpati idols creatively, showcasing their photography skills and perspectives.",
          "year": "2018-2019"
        },
        {
          "date": "11th September 2018",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "Legends of Champions League was a quiz conducted via WhatsApp, testing participants’ knowledge about the UEFA Champions League.",
          "year": "2018-2019"
        },
        {
          "date": "3rd September 2018",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "Mentor: Epitome for Life was an online initiative encouraging people to share stories about their mentors and their positive influence.",
          "year": "2018-2019"
        },
        {
          "date": "29th August 2018",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "To know members better.",
          "year": "2018-2019"
        },
        {
          "date": "27th August 2018",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "Celebration of Women's Equality Day with team-based speech activities where members spoke on various topics.",
          "year": "2018-2019"
        },
        {
          "date": "25th August 2018",
          "committee": "IQAC",
          "faculty": "Ms. Sangeeta Kore",
          "details": "Workshop for teachers on How to Develop E-Content.",
          "year": "2018-2019"
        },
        {
          "date": "25th August 2018",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "On the occasion of Rakshabandhan, celebrated with children of Bal Anand World Children Welfare Trust India.",
          "year": "2018-2019"
        },
        {
          "date": "15th August 2018",
          "committee": "N.S.S.",
          "faculty": "Dr. Swati Iyer",
          "details": "Volunteers collected unused clothes and made cloth bags out of them.",
          "year": "2018-2019"
        },
        {
          "date": "14th August 2018",
          "committee": "N.S.S.",
          "faculty": "Dr. Swati Iyer",
          "details": "Volunteers conducted class-to-class publicity about stem cell donation and gathered around 67 donors in collaboration with Marrow Donor India.",
          "year": "2018-2019"
        },
        {
          "date": "13th August 2018",
          "committee": "Women's Development Cell",
          "faculty": "Dr. Harini C.",
          "details": "A talk on gender sensitization was organised for FY B.Com students by Ms. Kirthy C. Nair, Research Scholar, TISS.",
          "year": "2018-2019"
        },
        {
          "date": "7th August 2018",
          "committee": "Students Counselling Committee",
          "faculty": "Dr. Harini C.",
          "details": "An orientation program for teachers on various psychological issues conducted by the Students Counselling Committee.",
          "year": "2018-2019"
        }
      ,

      
        {
          "date": "5th August 2018",
          "committee": "N.S.S.",
          "faculty": "Dr. Swati Iyer",
          "details": "Our volunteers went to Mhada Colony and gave Polio Immunization Vaccine to children below 5 years of age and also did publicity in that area so that most children could take benefit from the vaccine, which was in collaboration with Sion Transit Camp Hospital.",
          "year": "2018-2019"
        },
        {
          "date": "31st July 2018",
          "committee": "Students Counselling Committee",
          "faculty": "Dr. Harini C.",
          "details": "A session on anger management was organised by the counselling committee on 31st July 2018 for students.",
          "year": "2018-2019"
        },
        {
          "date": "26th July 2018",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "Green Hands, the Global Tree Plantation Project, is an initiative carried out by Searic, a Multi District Information Organization. It is a movement towards environmental protection and sustainability with the motive of planting saplings rightly known as 'The Trees of Tomorrow' in our vicinity.",
          "year": "2018-2019"
        },
        {
          "date": "26th July 2018",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "The project Kargil Vijay Divas was undertaken to celebrate the victory of India in the Kargil War and commemorate the sacrifices of our martyrs. An officer from the National Security Guard or Black Cat Commandos was invited as the guest of honor, who had an interactive session with members and participants. A documentary on the Kargil War was also played.",
          "year": "2018-2019"
        },
        {
          "date": "24th July 2018",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "Wonder In Pages (WOIP) is a project to encourage book exchange. To change the perception of judging books by their covers, Wonder in Pages was initiated to promote sharing and reading.",
          "year": "2018-2019"
        },
        {
          "date": "24th July 2018",
          "committee": "N.S.S.",
          "faculty": "Dr. Swati Iyer",
          "details": "A Hepatitis B vaccination drive was conducted in collaboration with SEHAT United Way Mumbai. It was the second vaccination drive for those who missed out earlier.",
          "year": "2018-2019"
        },
        {
          "date": "14th July 2018",
          "committee": "N.S.S.",
          "faculty": "Dr. Swati Iyer",
          "details": "Beach Clean-Up at Worli Fort. Two volunteers participated in a 24-hour clean-up which was included in the Limca Book of World Records for the longest continuous beach clean-up.",
          "year": "2018-2019"
        },
        {
          "date": "14th July 2018",
          "committee": "Website Committee",
          "faculty": "Ms. Divya Thakur",
          "details": "Handled COURSES, COMMITTEES, and AQR Report work including data segregation.",
          "year": "2018-2019"
        },
        {
          "date": "13th July 2018",
          "committee": "IQAC",
          "faculty": "Ms. Sangeeta Kore",
          "details": "Workshop for teachers on SPSS & AMOS.",
          "year": "2018-2019"
        },
        {
          "date": "7th July 2018",
          "committee": "N.S.S.",
          "faculty": "Dr. Swati Iyer",
          "details": "Tree plantation at Sion Fort with Archaeological Survey of India. Total 38 plants were planted in the vicinity of the fort.",
          "year": "2018-2019"
        },
        {
          "date": "7th July 2018",
          "committee": "N.S.S.",
          "faculty": "Dr. Swati Iyer",
          "details": "Sion Fort.",
          "year": "2018-2019"
        },
        {
          "date": "9th May 2018",
          "committee": "Placement Committee",
          "faculty": "Ms. Raina Banu Baji",
          "details": "Bandodkar College of Science, Thane conducted an LTI Placement Drive where 3 students got selected.",
          "year": "2018-2019"
        },
        {
          "date": "12th March 2018",
          "committee": "Placement Committee",
          "faculty": "Ms. Raina Banu Baji",
          "details": "Viva College, Virar conducted a Capgemini Placement Drive where 14 students got selected.",
          "year": "2018-2019"
        },
        {
          "date": "26th July 2017",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "An officer from the National Security Guard or Black Cat Commandos was invited as the guest of honor, who had an interactive session with the members and participants. A documentary on the Kargil War was also played.",
          "year": "2018-2019"
        },
        {
          "date": "7th March 2013",
          "committee": "IQAC",
          "faculty": "Ms. Sangeeta Kore",
          "details": "State level seminar on 'Intellectual Property Rights' for students.",
          "year": "2018-2019"
        },
        {
          "date": "20th September 2018",
          "committee": "Commerce Forum",
          "faculty": "Mr. Abhijeit Bhosale",
          "details": "As part of its extra-curricular activities, SIES-C&E organised its annual career guidance festival, 'DISHA - The Edu-tainment Fiesta.' Disha 2017 was scheduled for 18th–20th September 2017, but due to heavy rainfall, events on the 20th were rescheduled to 23rd September. The event included seminars, workshops, and competitions to promote awareness of new-age careers.",
          "year": "2017-2018"
        },
        {
          "date": "12th April 2018",
          "committee": "IQAC",
          "faculty": "Ms. Sangeeta Kore",
          "details": "English Language Development session on English Language Development.",
          "year": "2017-2018"
        },
        {
          "date": "31st March 2018",
          "committee": "Internship Cell",
          "faculty": "Mrs. Fleur Fernandes",
          "details": "128 students of the college were selected for internships during the year: 35 through the Internship Cell, 29 via Internshala tie-up, and 64 through self-arranged opportunities.",
          "year": "2017-2018"
        }
      
      
      
  ]