[
    {
      "date": "22nd March 2018",
      "committee": "IQAC",
      "faculty": "Ms. Sangeeta Kore",
      "details": "Personality Development program for non teaching staff- English Speaking, written communication",
      "year": "2017-2018"
    },
    {
      "date": "10th March 2018",
      "committee": "Placement Committee",
      "faculty": "Ms. Vanita Narmeta",
      "details": "TCS company conducted placement drive and 5 students were selected.",
      "year": "2017-2018"
    },
    {
      "date": "7th March 2018",
      "committee": "IQAC",
      "faculty": "Ms. Sangeeta Kore",
      "details": "Session for teachers on Approach to Project Design with Specific ref. to Project Funding",
      "year": "2017-2018"
    },
    {
      "date": "6th March 2018",
      "committee": "IQAC",
      "faculty": "Ms. Sangeeta Kore",
      "details": "Personality Development program for non teaching staff on Personal Grooming",
      "year": "2017-2018"
    },
    {
      "date": "2nd February 2018",
      "committee": "N.S.S.",
      "faculty": "Mr. Vinayak Krishnan",
      "details": "NSS Unit, in collaboration with Mumbai Police and Samsung India, organised a drive on road safety on 2nd February, 2018 in the college premises. A canter was brought in, and with the help of skits and interactions, the students were informed about the importance of road safety.",
      "year": "2017-2018"
    },
    {
      "date": "1st February 2018",
      "committee": "N.S.S.",
      "faculty": "Mr. Vinayak Krishnan",
      "details": "The first course of vaccination against Hepatitis B was held on February 1, 2018 in our college premises. Nearly 200 people among students, faculty members and non-teaching staff members benefited from this initiative, organised by the NSS unit of our college, in collaboration with United Way Mumbai.",
      "year": "2017-2018"
    },
    {
      "date": "29th January 2018",
      "committee": "Placement Committee",
      "faculty": "Ms. Vanita Narmeta",
      "details": "K.P.B. Hinduja College conducted Infosys placement drive and 4 students were selected.",
      "year": "2017-2018"
    },
    {
      "date": "11th January 2018",
      "committee": "N.S.S.",
      "faculty": "Mr. Vinayak Krishnan",
      "details": "The NSS Unit of our college, in collaboration with United Way Mumbai, organised games on Road Safety for all students on Thursday, January 11th, 2018. The Spinning Wheel, The Pledge Wall, trace a coin using Alcohol Goggles, and Snake and Ladder were instrumental in conveying the message of Driving Responsibly.",
      "year": "2017-2018"
    },
    {
      "date": "9th January 2018",
      "committee": "N.S.S.",
      "faculty": "Mr. Vinayak Krishnan",
      "details": "A seminar and demonstration on road safety, with the theme, Two Wheels One Life was organised by United Way India for the NSS student volunteers on Thursday, 09th January, 2018.",
      "year": "2017-2018"
    },
    {
      "date": "21st December 2017",
      "committee": "Rotract Club",
      "faculty": "Ms. Falguni Mathews",
      "details": "Yash Trivedi founder leader of the Must Ache family was invited to conduct the workshop.",
      "year": "2017-2018"
    },
    {
      "date": "15th December 2017",
      "committee": "Rotract Club",
      "faculty": "Ms. Falguni Mathews",
      "details": "This event was a tea making event on the occasion of International Tea Day, wherein the club provided each team with Rs. 50 and encouraged them to make maximum profits which later would be divided into half i.e. 50% to the club and 50% to the team. There were four teams namely India, Sri Lanka, Indonesia and Malaysia; each team had 3-5 members. The tea was made according to the country’s special tea flavors.",
      "year": "2017-2018"
    },
    {
      "date": "14th December 2017",
      "committee": "N.S.S.",
      "faculty": "Dr. Swati Iyer",
      "details": "NSS residential camp was organized at Shivansai village, Panvel Taluka, Raigad district from 14/12/2017 to 20/12/2017. Around 50 students participated in the camp.",
      "year": "2017-2018"
    },
    {
      "date": "7th December 2017",
      "committee": "Rotract Club",
      "faculty": "Ms. Falguni Mathews",
      "details": "On 18th of July 2017 i.e. On Nelson Mandela International day, we visited the NGO and celebrated Nelson Mandela International day with 90 girls belonging to the NGO by conducting various games and activities. A short film on the life of Nelson Mandela was also shown to the kids thereby educating them about Nelson Mandela and the importance of this day.",
      "year": "2017-2018"
    },
    {
      "date": "5th December 2017",
      "committee": "Rotract Club",
      "faculty": "Ms. Falguni Mathews",
      "details": "Letters from North Pole was an initiative by the Editorial team, wherein a writer would give a unique and loveable Christmas present to their loved ones by writing to them as Santa Claus. These letters were then sent to its recipients on Christmas day, they were asked to guess who wrote it for them; if they failed to recognize, a hint was given.",
      "year": "2017-2018"
    },
    {
      "date": "2nd December 2017",
      "committee": "Placement Committee",
      "faculty": "Ms. Vanita Narmeta",
      "details": "Vidyalankar School of Information College conducted Capgemini Placement drive and 3 students were selected.",
      "year": "2017-2018"
    },
    {
      "date": "10th November 2017",
      "committee": "Rotract Club",
      "faculty": "Ms. Falguni Mathews",
      "details": "Rohan Dalmia, the IPDRR of RID 3141 and Chairman of PR and Finance Avenue, was invited to conduct the Marketing Seminar titled, 'All about Marketing'.",
      "year": "2017-2018"
    },
    {
      "date": "8th November 2017",
      "committee": "IQAC",
      "faculty": "Ms. Sangeeta Kore",
      "details": "Workshop for teachers on Personal Branding.",
      "year": "2017-2018"
    },
    {
      "date": "3rd November 2017",
      "committee": "IQAC",
      "faculty": "Ms. Sangeeta Kore",
      "details": "Workshop for non teaching Staff on Enhancing oral Communication.",
      "year": "2017-2018"
    },
    {
      "date": "3rd November 2017",
      "committee": "Rotract Club",
      "faculty": "Ms. Falguni Mathews",
      "details": "The editor had given two spooky scenarios in first person perspective on which the participant had to write his or her story. It was a complete online event. Entries were collected through Google form, and the editor picked the first three best entries and featured them on the official club blog.",
      "year": "2017-2018"
    },
    
        {
          "date": "16th October 2017",
          "committee": "N.S.S.",
          "faculty": "Dr. Swati Iyer",
          "details": "Street play was conducted at the Kings Circle Railway Station on 'Railway Safety' which was well appreciated by the station master.",
          "year": "2017-2018"
        },
        {
          "date": "13th October 2017",
          "committee": "Library",
          "faculty": "Mrs. Anuprita Sardesai",
          "details": "Hands-on training on using J-Gate online resources was organised. Mr. Mayank Dedhia from Informatics Publishing Limited conducted the session.",
          "year": "2017-2018"
        },
        {
          "date": "4th October 2017",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "Motivational speaker Mr. Hitesh Ramchandani, a global motivational speaker, Paralympian, and author of the book 'Better Than Normal', was invited to conduct the motivational session.",
          "year": "2017-2018"
        },
        {
          "date": "29th September 2017",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "Mr. Prathamesh Bandekar, a professional Zumba fitness instructor, took a workshop introducing the dance form, its need and importance, followed by an energetic session and health tips.",
          "year": "2017-2018"
        },
        {
          "date": "29th September 2017",
          "committee": "Womens Development Cell",
          "faculty": "Dr. Harini C.",
          "details": "A session on sexual harassment: Responses and remedies was organised by WDC and ICC in the auditorium. The speaker for the event was Adv. Nausheen from Majlis.",
          "year": "2017-2018"
        },
        {
          "date": "28th September 2017",
          "committee": "Womens Development Cell",
          "faculty": "Dr. Harini C.",
          "details": "A talk on cyber bullying was organised by WDC. The speaker was Ms. Nirali Bhatia.",
          "year": "2017-2018"
        },
        {
          "date": "28th September 2017",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "The project was all about school flashback where members played childhood games like langdi. Members were divided into groups; the 'denner' had to hop on one foot to catch runners.",
          "year": "2017-2018"
        },
        {
          "date": "27th September 2017",
          "committee": "Womens Development Cell",
          "faculty": "Dr. Harini C.",
          "details": "To improve the functional English of vernacular medium students, a session was organised by WDC. The resource person was Ms. Manisha Sridhar.",
          "year": "2017-2018"
        },
        {
          "date": "25th September 2017",
          "committee": "Students Counselling Committee",
          "faculty": "Dr. Harini C.",
          "details": "Students Counselling Committee in association with IQAC organised a workshop on cyber safety and youth. The speaker was Mr. Ritesh Bhatia, a cyber security expert.",
          "year": "2017-2018"
        },
        {
          "date": "25th September 2017",
          "committee": "Womens Development Cell",
          "faculty": "Dr. Harini C.",
          "details": "A 2-hour session on constitutional rights and uniform civil code was organised by WDC in association with IQAC. Ms. Audrey D’Mello from Majlis was the speaker.",
          "year": "2017-2018"
        },
        {
          "date": "23rd September 2017",
          "committee": "Speakers Forum",
          "faculty": "Ms. Manasi Shah",
          "details": "The 53rd A.D. Shroff Memorial Elocution Competition was organised by the Speakers Forum of SIES College of Commerce and Economics.",
          "year": "2017-2018"
        },
        {
          "date": "22nd September 2017",
          "committee": "Womens Development Cell",
          "faculty": "Dr. Harini C.",
          "details": "WDC SIES CE in collaboration with Majlis organised 'Expression' for students.",
          "year": "2017-2018"
        },
        {
          "date": "22nd September 2017",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "Sanjana Sharma, a world-renowned belly dancer and senior instructor at Kohl Belly Dance Movement, was invited to conduct a belly dancing session for students.",
          "year": "2017-2018"
        },
        {
          "date": "22nd September 2017",
          "committee": "Womens Development Cell",
          "faculty": "Dr. Harini C.",
          "details": "WDC organised a cultural competition in association with MAJLIS including Rangoli, elocution, recitation and poster making with the theme 'What is your Yes and what is your No'.",
          "year": "2017-2018"
        },
        {
          "date": "21st September 2017",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "A desk was set up in the college campus to show support towards peace using palm prints on a white cloth forming a peace logo.",
          "year": "2017-2018"
        },
        {
          "date": "15th September 2017",
          "committee": "Womens Development Cell",
          "faculty": "Dr. Harini C.",
          "details": "A self-defense training program was organised by WDC. The trainer was Mr. Vijay Patil.",
          "year": "2017-2018"
        },
        {
          "date": "15th September 2017",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "A sports event featuring Ultimate Frisbee and Futsal Mania was organised. Teams participated in knockout rounds and league matches.",
          "year": "2017-2018"
        },
        {
          "date": "14th September 2017",
          "committee": "Womens Development Cell",
          "faculty": "Dr. Harini C.",
          "details": "A talk on women and media was organised by WDC for students and faculty members.",
          "year": "2017-2018"
        },
        {
          "date": "8th September 2017",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "Funds of Rs. 1,60,000 were raised for a cause through member efforts and contributions from other Rotaract clubs.",
          "year": "2017-2018"
        },
        {
          "date": "8th September 2017",
          "committee": "Placement Committee",
          "faculty": "Ms. Vanita Narmeta",
          "details": "Hinduja College conducted Deloitte placement drive and 1 student was selected.",
          "year": "2017-2018"
        },
        {
          "date": "24th August 2017",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "Seven teams participated in a movie-based quiz with three rounds: songs, pictures, and mute dialogues.",
          "year": "2017-2018"
        },
        {
          "date": "12th August 2017",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "The official installation ceremony of the new President and Board of Directors was conducted, attended by 132 people and notable Rotaract dignitaries.",
          "year": "2017-2018"
        },
        {
          "date": "4th August 2017",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "The project involved interviewing random friends in the college about their friendship to celebrate Friendship Day.",
          "year": "2017-2018"
        },
        {
          "date": "28th July 2017",
          "committee": "Placement Committee",
          "faculty": "Ms. Vanita Narmeta",
          "details": "Hinduja College conducted L & T placement drive and 5 students were selected.",
          "year": "2017-2018"
        },
        {
          "date": "7th July 2017",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "Jeevan Daan – a mega blood donation drive was organized at Mulund Railway Station as part of Rotaract district 3141 initiative.",
          "year": "2017-2018"
        },
        {
          "date": "12th April 2017",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "The Project 'Pictionary' was a drawing game event where teammates guessed drawings under time limits, sometimes using non-dominant hands.",
          "year": "2017-2018"
        },
        {
          "date": "15th March 2017",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "Mahadaan was a mega blood donation project conducted jointly by several Rotaract clubs in association with J.J. Mahanagar Blood Bank.",
          "year": "2017-2018"
        },
        {
          "date": "11th March 2017",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "Fun gaming event featuring Lip Print, Water Pong, and Face the Cookie competitions among members.",
          "year": "2017-2018"
        },
        {
          "date": "8th March 2017",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "The project involved asking random men their opinion about women on International Women’s Day, filmed by the team.",
          "year": "2017-2018"
        },
        {
          "date": "13th February 2017",
          "committee": "Placement Committee",
          "faculty": "Ms. Vanita Narmeta",
          "details": "Nokia Here conducted placement drive in our college and 2 students were selected.",
          "year": "2017-2018"
        },
        {
          "date": "2nd January 2017",
          "committee": "Rotract Club",
          "faculty": "Ms. Falguni Mathews",
          "details": "The writing project had participants imagine meeting their future selves and reflect on life lessons and advice.",
          "year": "2017-2018"
        }
      
      
  ]
  